{
    "navLinks.home": "Hogar",
    "navLinks.work": "Nuestro trabajo",
    "navLinks.careers": "Carreras",
    "navLinks.contact": "Contáctenos",
    "contact us": "Contáctenos",
    "Use technology to your advantage": "Usa la tecnología a tu favor",
    "Experience our unwavering commitment to delivering exceptional IT solutions with integrity and transparency": "Experimente nuestro compromiso inquebrantable de brindar soluciones de TI excepcionales con integridad y transparencia",
    "Book Free Consultation": "Reserve una consulta gratuita",
    "About Us": "Sobre nosotras",
    "As the world evolves and technological advances increase, businesses face the challenge of keeping processes and systems up to date, replacing legacy systems with newer tech. Companies worldwide rely on emerging technologies to drive strategy and growth, giving them a competitive edge.": "A medida que el mundo evoluciona y aumentan los avances tecnológicos, las empresas enfrentan el desafío de mantener los procesos y sistemas actualizados, reemplazando los sistemas heredados con tecnología más nueva. Las empresas de todo el mundo confían en las tecnologías emergentes para impulsar la estrategia y el crecimiento, lo que les otorga una ventaja competitiva.",
    "At March, we help companies incorporate the latest technologies into their business models and provide a seamless experience to customers while building strategic models that define the best ways to sell, upsell, and cross-sell products.": "En March, ayudamos a las empresas a incorporar las últimas tecnologías en sus modelos comerciales y brindamos una experiencia fluida a los clientes mientras construimos modelos estratégicos que definen las mejores formas de vender, aumentar las ventas y realizar ventas cruzadas de productos.",
    "Our Vision": "Nuestra visión",
    "At Marchcroft, we solve  business problems with technology. Whether that is building a new product, improving existing processes or helping companies become digitally connected. We focus on creating economic growth through strategic assessment of our client needs, providing operational support, ensuring operational excellence and guaranteeing the security of confidential information and trade advantages.": "En Marchcroft, resolvemos problemas comerciales con tecnología. Ya sea creando un nuevo producto, mejorando los procesos existentes o ayudando a las empresas a conectarse digitalmente. Nos enfocamos en generar crecimiento económico a través de la evaluación estratégica de las necesidades de nuestros clientes, brindando soporte operativo, asegurando la excelencia operativa y garantizando la seguridad de la información confidencial y las ventajas comerciales.",
    "Our Solutions": "Nuestras soluciones",
    "Introducing our Comprehensive Solutions Suite": "Presentamos nuestra Suite de Soluciones Integrales",
    "Increase Delivery Times": "Aumentar Tiempos de Entrega",
    "Utilizing technology-driven solutions to expedite delivery processes, enabling swift and efficient product or service distribution": "Utilización de soluciones impulsadas por la tecnología para acelerar los procesos de entrega, permitiendo una distribución rápida y eficiente de productos o servicios",
    "Greenfield Projects": "Proyectos Greenfield",
    "Leveraging technology to pioneer new ventures, ignite innovation, and embark on fresh and transformative business endeavors": "Aprovechar la tecnología para ser pioneros en nuevos emprendimientos, impulsar la innovación y embarcarse en emprendimientos comerciales frescos y transformadores",
    "Performance & Cost": "Rendimiento y costo",
    "Harnessing technology to enhance business efficiency, streamline processes, and reduce costs, driving optimal performance": "Aprovechar la tecnología para mejorar la eficiencia empresarial, agilizar los procesos y reducir los costos, impulsando un rendimiento óptimo",
    "Scalable Products": "Productos escalables",
    "Leveraging technology’s scalability to create adaptable and flexible products, ensuring seamless growth and future-proofing businesses": "Aprovechando la escalabilidad de la tecnología para crear productos adaptables y flexibles, asegurando un crecimiento continuo y negocios preparados para el futuro",
    "Eco-Friendly Solutions": "Soluciones Ecológicas",
    "Utilizing technology to enhance interactions, personalize offerings, and create memorable customer journeys, elevating satisfaction levels": "Utilizar la tecnología para mejorar las interacciones, personalizar las ofertas y crear viajes memorables para los clientes, elevando los niveles de satisfacción",
    "Increase ROI": "Aumentar el ROI",
    "Harness tech to develop environmentally conscious and sustainable solutions, fostering greener approach to business practices": "Aprovechar la tecnología para desarrollar soluciones sostenibles y respetuosas con el medio ambiente, fomentando un enfoque más ecológico de las prácticas empresariales",
    "Services We Offer": "Servicios que ofrecemos",
    "A quick intro of the services we offer at Marchcroft": "Una breve introducción a los servicios que ofrecemos en Marchcroft",
    "Strategic Consultancy": "Strategic Consultancy",
    "Our dependable client teams pinpoint problem areas and recommend services or goods that can help with business requirements. We focus on discovering customer value and increasing interest return on digital solutions. Based on market-leading frameworks, we customise solutions to fit unique customer demands.Our dependable client teams pinpoint problem areas and recommend services or goods that can help with business requirements. We focus on discovering customer value and increasing interest return on digital solutions. Based on market-leading frameworks, we customise solutions to fit unique customer demands.": "Nuestros equipos de clientes confiables identifican áreas problemáticas y recomiendan servicios o productos que pueden ayudar con los requisitos comerciales. Nos enfocamos en descubrir el valor del cliente y aumentar el retorno de interés en las soluciones digitales. Basados en marcos líderes en el mercado, personalizamos soluciones para satisfacer las demandas únicas de los clientes. Nuestros equipos de clientes confiables identifican áreas problemáticas y recomiendan servicios o productos que pueden ayudar con los requisitos comerciales. Nos enfocamos en descubrir el valor del cliente y aumentar el retorno de interés en las soluciones digitales. Basados en marcos líderes en el mercado, personalizamos soluciones para satisfacer las demandas únicas de los clientes.",
    "Software Architecture & Infrastructure": "Arquitectura e infraestructura de software",
    "Enhancing and implementing key software elements that support business operations, finance, and security within the organisation. We focus on speeding up the digital transformation process, mitigating risk, scaling quickly, and bringing business and IT together.": "Mejorar e implementar elementos de software clave que respaldan las operaciones comerciales, las finanzas y la seguridad dentro de la organización. Nos enfocamos en acelerar el proceso de transformación digital, mitigar el riesgo, escalar rápidamente y unir negocios y TI.",
    "Digital Transformation": "Transformación Digital",
    "We help our clients to be more digitally connected, accelerate the delivery of products and increase the return on interest. Our approach is to employ agile culture and mindset, building cross-functional teams and guaranteeing success through data metrics.": "Ayudamos a nuestros clientes a estar más conectados digitalmente, acelerar la entrega de productos y aumentar la rentabilidad de los intereses. Nuestro enfoque es emplear una mentalidad y una cultura ágiles, crear equipos multifuncionales y garantizar el éxito a través de métricas de datos.",
    "Engineering and Technology": "Ingeniería y Tecnología",
    "Utilise cutting-edge technologies to give the business a competitive edge. We help our clients to ensure they are keeping up to date with tech. Better performing system, insights to data and securing of assets and competitive advantages.": "Utilizar tecnologías de vanguardia para dar a la empresa una ventaja competitiva. Ayudamos a nuestros clientes a asegurarse de que se mantengan al día con la tecnología. Mejor rendimiento del sistema, conocimiento de los datos y protección de activos y ventajas competitivas.",
    "UX Design": "Diseño de experiencia de usuario",
    "To create the best User Experience (UX) strategy, it is essential to match your business goals with your clients. Our team conducts research to develop a tailored and cohesive experience that is aligned with your overall brand stance. Our team thoroughly tests with users at each step of the process for product success. Company reputation is our aim, focusing on what matters to customers and providing our clients with a competitive advantage.": "Para crear la mejor estrategia de experiencia de usuario (UX), es esencial hacer coincidir sus objetivos comerciales con sus clientes. Nuestro equipo realiza investigaciones para desarrollar una experiencia personalizada y cohesiva que esté alineada con la postura general de su marca. Nuestro equipo realiza pruebas exhaustivas con los usuarios en cada paso del proceso para el éxito del producto. La reputación de la empresa es nuestro objetivo, centrándonos en lo que es importante para los clientes y ofreciéndoles una ventaja competitiva.",
    "Cloud": "Nube",
    "Building resilience in software architecture can be achieved through cloud technology. Our teams focus on building organisational agility, implementing delivery pipelines and high service availability, therefore driving growth.": "La construcción de resiliencia en la arquitectura de software se puede lograr a través de la tecnología en la nube. Nuestros equipos se enfocan en generar agilidad organizacional, implementar canales de entrega y alta disponibilidad del servicio, lo que impulsa el crecimiento.",
    "How We Work": "Cómo trabajamos",
    "A deep dive on how we work with our clients and our work process": "Una inmersión profunda en cómo trabajamos con nuestros clientes y nuestro proceso de trabajo",
    "Understand your problems": "Entiende tus problemas",
    "Our experts will develop a strategic solution, including architecture designs and mockup": "Nuestros expertos desarrollarán una solución estratégica, incluidos diseños de arquitectura y maquetas.",
    "Agile Work Cycle": "Ciclo de trabajo ágil",
    "Your product is being worked on. get frequent updates during the delivery cycle": "Se está trabajando en su producto. obtener actualizaciones frecuentes durante el ciclo de entrega",
    "Go live": "Ir a vivir",
    "We will be there to support you even after completion day": "Estaremos allí para apoyarlo incluso después del día de finalización",
    "Success": "Éxito",
    "We make sure your product is top-notch and drive revenue": "Nos aseguramos de que su producto sea de primera categoría y genere ingresos",
    "Our Technology Stack": "Nuestra pila de tecnología",
    "Our tech stack drives digital transformation, empowering businesses wth cutting-edge tools and platforms. From robust backends to seamless user experience, we deliver scalable, secure, and efficient solutions": "Nuestra pila tecnológica impulsa la transformación digital, empoderando a las empresas con herramientas y plataformas de vanguardia. Desde backends robustos hasta una experiencia de usuario perfecta, ofrecemos soluciones escalables, seguras y eficientes.",
    "Our Work": "Nuestro trabajo",
    "See what our customers have to say about working with us": "Vea lo que nuestros clientes tienen que decir acerca de trabajar con nosotros",
    "I’ve been using Marchcroft for two months now. Aside their exceptional   business services their customer services is peak and lovely! Looking forward to get more things done with the wonderful team": "He estado usando Marchcroft durante dos meses. ¡Además de sus excepcionales servicios comerciales, su servicio al cliente es excelente y encantador! Con ganas de hacer más cosas con el maravilloso equipo.",
    "- P Williams, Securely": "- P Williams, con seguridad",
    "I'm highly impressed with Marchcroft consulting. Their expertise, clear communication, and efficient implementation resulted in a solution that exceeded our expectations. They're a top-notch partner for software consulting.": "Estoy muy impresionado con la consultoría de Marchcroft. Su experiencia, comunicación clara e implementación eficiente dieron como resultado una solución que superó nuestras expectativas. Son un socio de primer nivel para la consultoría de software.",
    "- James Hardy, Coinclustr": "- James Hardy, Coincluster",
    " A valuable partner that consistently goes above and beyond.": "Un socio valioso que constantemente va más allá.",
    "- Marc Consulting": "- Marc Consulting",
    "Talk to Us": "Háblanos",
    "Get in touch to discuss your digital ambitions. We can help you achieve them": "Póngase en contacto para discutir sus ambiciones digitales. Podemos ayudarte a conseguirlos",
    "Compliance services": "Servicios de cumplimiento",
    "Privacy": "Privacidad",
    "Terms of service": "Términos de servicio",
    "Get In Touch": "Ponerse en contacto",
    "Recent blog posts": "Entradas recientes del blog",
    "Load More": "Carga más",
    "Read more": "Leer más",
    "How We Use Artificial Intelligence to Improve Customer Service": "Cómo usamos la inteligencia artificial para mejorar el servicio al cliente",
    "Artificial intelligence (AI) is one of the revolutionary technologies that has had an impact on several industries in the last few years. As an IT company, we have integrated AI into many of our workflows to streamline operations and enhance our effectiveness and productivity. To help you understand how we leverage the power of AI, this article will explore some of the ways we use it to enhance customer service. ": "La inteligencia artificial (IA) es una de las tecnologías revolucionarias que ha tenido impacto en varias industrias en los últimos años. Como empresa de TI, hemos integrado la IA en muchos de nuestros flujos de trabajo para optimizar las operaciones y mejorar nuestra eficacia y productividad. Para ayudarlo a comprender cómo aprovechamos el poder de la IA, este artículo explorará algunas de las formas en que la usamos para mejorar el servicio al cliente.",
    "Work we have done for Vehya": "Trabajo que hemos hecho para Vehya",
    "At Marchcroft, our vision is to utilize cutting-edge technologies to assist businesses in streamlining their operations, thereby enhancing efficiency and productivity. In one of our recent projects, we collaborated with Vehya, a marketplace for electrification products, to enhance various existing features on their platform.  This article aims to provide you with comprehensive insights into this project, including the various tasks we handled during this project. Without further ado, let's delve in right away!": "En Marchcroft, nuestra visión es utilizar tecnologías de vanguardia para ayudar a las empresas a optimizar sus operaciones, mejorando así la eficiencia y la productividad. En uno de nuestros proyectos recientes, colaboramos con Vehya, un mercado de productos de electrificación, para mejorar varias funciones existentes en su plataforma. Este artículo tiene como objetivo brindarle información detallada sobre este proyecto, incluidas las diversas tareas que manejamos durante este proyecto. Sin más preámbulos, ¡profundicemos de inmediato!",
    "Creating a Property Investment Tool from Scratch": "Creación de una herramienta de inversión inmobiliaria desde cero",
    "At Marchcroft, we develop products for businesses in various industries, including Fintech. With this project, we were tasked with developing Propsmarts – a comprehensive property investment tool that allows users to buy or sell real estate properties, such as land, all on one platform. In this article, we will walk you through the process we went through while handling this project. Let’s dive right in! ": "En Marchcroft, desarrollamos productos para empresas en diversas industrias, incluida Fintech. Con este proyecto, se nos encargó desarrollar Propsmarts, una herramienta integral de inversión inmobiliaria que permite a los usuarios comprar o vender propiedades inmobiliarias, como terrenos, todo en una plataforma. En este artículo, lo guiaremos a través del proceso por el que pasamos mientras manejamos este proyecto. ¡Vamos a sumergirnos!",
    "Open roles": "Abrir roles",
    "Competencies": "Competencias",
    "Experience required": "Experiencia requerida",
    "Location": "Ubicación",
    "Careers": "Carreras",

    "Senior Full Stack Software Engineer": "Ingeniero de software sénior de pila completa",
    "Are you a passionate Senior Full Stack Engineer seeking a new opportunity to work on innovative projects? Join our team and make an impact on cutting-edge technologies!": "¿Es usted un apasionado Ingeniero Senior Full Stack que busca una nueva oportunidad para trabajar en proyectos innovadores? ¡Únase a nuestro equipo y tenga un impacto en las tecnologías de vanguardia!",
    "Competitive £/hr": "competitiva £/hora",
    "We are looking for an enthusiastic and inquisitive individual who can think creatively to solve problems and meet user requirements. You must have a keen interest in software requirements and have a keen interest in sofware engineering and be ready to research and learn new techniques, languages and frameworks. Working with a DevSecOps mindset, you will be developing, delivering and operating applications using a secure approach.": "Buscamos a una persona entusiasta e inquisitiva que pueda pensar de forma creativa para resolver problemas y cumplir con los requisitos de los usuarios. Debe tener un gran interés en los requisitos de software y en la ingeniería de software y estar listo para investigar y aprender nuevas técnicas y lenguajes. y marcos. Al trabajar con una mentalidad de DevSecOps, desarrollará, entregará y operará aplicaciones utilizando un enfoque seguro.",
    "Contributing to the development and refinement of user requirements.": "Contribuir al desarrollo y perfeccionamiento de los requisitos de los usuarios.",
    "Actively contribute to Scrum ceremonies such as Refinement, Sprint Planning and Retrospective.": "Contribuir activamente a las ceremonias de Scrum como Refinamiento, Planificación de Sprint y Retrospectiva.",
    "Designing innovative solutions to solve problems and meet requirements.": "Diseñar soluciones innovadoras para resolver problemas y cumplir requisitos.",
    "Elaborate solutions at a high level and create low level designs that conforms to set standards.": "Elabore soluciones de alto nivel y cree diseños de bajo nivel que se ajusten a los estándares establecidos.",
    "Communicate effectively to a variety of audiences including both technical and non-technical stakeholders.": "Comuníquese de manera efectiva con una variedad de audiencias, incluidas las partes interesadas tanto técnicas como no técnicas.",
    "Leading Demo Sessions as part of sprint reviews.": "Liderar sesiones de demostración como parte de las revisiones de sprint.",
    "Implementing solutions using a variety of programming languages, frameworks, tools and techniques.": "Implementación de soluciones usando una variedad de lenguajes de programación, marcos, herramientas y técnicas.",
    "Encourage and practice TDD and other Delivery Best practices.": "Fomentar y practicar TDD y otras mejores prácticas de entrega.",
    "Producing applicable technical documentation.": "Elaboración de la documentación técnica aplicable.",
    "Contribute to improvements of our technical excellence and ways of working within Squad, Chapter and Guild forums.": "Contribuir a mejorar nuestra excelencia técnica y formas de trabajar dentro de los foros de Squad, Chapter y Guild.",
    "Actively Contribute to and progress the technical roadmap.": "Contribuir activamente y avanzar en la hoja de ruta técnica.",
    "Mentoring Software Engineers, Graduate and Junior population.": "Tutoría de ingenieros de software, población graduada y junior.",
    "Address Technical Debt and consistently recommend Continuous Improvement initiatives.": "Abordar la deuda técnica y recomendar constantemente iniciativas de mejora continua.",
    "Competent in DevOps approach and practices.": "Competente en el enfoque y las prácticas de DevOps.",
    "Identification and ownership of NFRs.": "Identificación y propiedad de los NFR.",
    "Actively encourage and provide knowledge transfer during the delivery stride.": "Fomentar y proporcionar activamente la transferencia de conocimientos durante el paso de entrega.",

    "Experience developing, implementing, and maintaining applications written in either of Java, Kotlin or Python.": "Experiencia en el desarrollo, implementación y mantenimiento de aplicaciones escritas en Java, Kotlin o Python.",
    "Web services development experience using spring boot or similar.":"Experiencia en desarrollo de servicios web usando spring boot o similar.",
    "Web development experience using HTML, CSS and a JavaScript/TypeScript framework, preferably Angular 2+.": "Experiencia en desarrollo web usando HTML, CSS y un marco JavaScript/TypeScript, preferiblemente Angular 2+.",
    "Experience with SQL and relational database technologies such as PostgreSQL, MySQL or MS SQL.": "Experiencia con SQL y tecnologías de bases de datos relacionales como PostgreSQL, MySQL o MS SQL.",
    "Experience with development tools such as Git, Maven, npm etc." : "Experiencia con herramientas de desarrollo como Git, Maven, npm, etc.",
    "Experience with Cloud technologies (Google Cloud Platform preferred but others would be considered).": "Experiencia con tecnologías en la nube (se prefiere Google Cloud Platform, pero se considerarían otras).",
    "Experience with CI/CD pipelines, ideally Azure DevOps.": "Experiencia con canalizaciones de CI/CD, idealmente Azure DevOps.",
    "Experience with Service Mesh Technologies preferably Istio or Anthos": "Experiencia con Service Mesh Technologies preferiblemente Istio o Anthos",
    "Experience with Docker, Kubernetes, Helm, or Terraform.": "Experiencia con Docker, Kubernetes, Helm o Terraform.",
    "Experience with BigQuery is an added advantage.": "La experiencia con BigQuery es una ventaja adicional.",
    "A good mix of the competencies mentioned above is required for the candidate to be successful within a squad in Data Tribe. The squad will contain engineers with similar profile with various areas of expertise. The senior is expected to make use of these expertise areas to arrive at a solution that can be built, delivered and operated in a productionized environment.": "Se requiere una buena combinación de las competencias mencionadas anteriormente para que el candidato tenga éxito dentro de un escuadrón en Data Tribe. El escuadrón contendrá ingenieros con un perfil similar con varias áreas de especialización. Se espera que el senior haga uso de estas áreas de especialización para llegar a una solución que se pueda construir, entregar y operar en un entorno de producción.",
    "This role can be offered on a hybrid or fully remote working basis.": "Este puesto se puede ofrecer de forma híbrida o totalmente remota.",


    "More advanced chatbot-based support": "Soporte más avanzado basado en chatbot",
    "Recent advancements in AI technology have greatly improved the effectiveness of chatbots for customer support. With enhanced natural language processing, chatbots can now provide accurate and reliable solutions to a wide range of customer questions. This has made customers more comfortable interacting with chatbots, as they can expect precise solutions to their problems. As a result, chatbots can now handle simple and common inquiries, allowing human support agents to focus on more complex tasks. ": "Los avances recientes en la tecnología de IA han mejorado en gran medida la eficacia de los chatbots para la atención al cliente. Con el procesamiento mejorado del lenguaje natural, los chatbots ahora pueden brindar soluciones precisas y confiables a una amplia gama de preguntas de los clientes. Esto ha hecho que los clientes se sientan más cómodos interactuando con los chatbots, ya que pueden esperar soluciones precisas a sus problemas. Como resultado, los chatbots ahora pueden manejar consultas simples y comunes, lo que permite que los agentes de soporte humanos se centren en tareas más complejas. ",
    "Personalized Interactions": "Interacciones personalizadas",
    "By using AI algorithms, it is now much easier for us to analyze a customer's historical data and behavior to gain insights into their preferences, purchase history, and past interactions with our company. Armed with this information, our teams can easily provide recommendations, offers, and solutions that are relevant to the customer. This level of personalization not only enhances customer engagement but also makes customers feel valued and understood by our company. ": "Mediante el uso de algoritmos de IA, ahora es mucho más fácil para nosotros analizar los datos históricos y el comportamiento de un cliente para obtener información sobre sus preferencias, historial de compras e interacciones pasadas con nuestra empresa. Armados con esta información, nuestros equipos pueden proporcionar fácilmente recomendaciones, ofertas y soluciones que son relevantes para el cliente. Este nivel de personalización no solo mejora el compromiso del cliente, sino que también hace que los clientes se sientan valorados y comprendidos por nuestra empresa. ",
    "Predictive Analytics": "Análisis predictivo",
    "Making future predictions has become much easier than ever, thanks to advancements in AI and data analytics. Leveraging AI-driven predictive analytics, which involves using historical customer data and patterns to anticipate future needs and behaviors enables us to offer solutions or assistance ahead of time. For instance, our systems can predict customers' needs based on their previous interactions and automatically recommend one of our services to them. ": "Hacer predicciones futuras se ha vuelto mucho más fácil que nunca, gracias a los avances en IA y análisis de datos. Aprovechar el análisis predictivo impulsado por IA, que implica el uso de datos y patrones históricos de clientes para anticipar necesidades y comportamientos futuros, nos permite ofrecer soluciones o asistencia con anticipación. Por ejemplo, nuestros sistemas pueden predecir las necesidades de los clientes en función de sus interacciones anteriores y recomendarles automáticamente uno de nuestros servicios. ",
    "Data-Driven decision": "Decisión basada en datos",
    "Effective decision-making can significantly influence a company's service delivery. Through the utilization of AI analytics on customer data, we can extract valuable insights about trends, preferences, and areas of concern. These insights empower our team to make well-informed decisions to enhance our customers' experience. ": "La toma de decisiones eficaz puede influir significativamente en la prestación de servicios de una empresa. A través de la utilización de análisis de IA en los datos de los clientes, podemos extraer información valiosa sobre tendencias, preferencias y áreas de interés. Estos conocimientos permiten a nuestro equipo tomar decisiones bien informadas para mejorar la experiencia de nuestros clientes. ",
    "For instance, our systems can analyze data about project delivery times, pinpointing gaps in our service provision. This helps in making the right choice when determining how we can improve the way we deal with client projects.": "Por ejemplo, nuestros sistemas pueden analizar datos sobre tiempos de entrega de proyectos, identificando brechas en nuestra prestación de servicios. Esto ayuda a tomar la decisión correcta al determinar cómo podemos mejorar la forma en que tratamos los proyectos de los clientes.",
    "Self-Service Portals": "Portales de autoservicio",
    "To further enhance our customer support reliability, we use an AI-powered self-service portal. This portal allows customers to access information, troubleshoot problems, and find solutions independently without needing direct interaction with a support agent. Ultimately, this allows customers to find solutions on their own terms and also frees up our support team to focus on more complex inquiries. ": "Para mejorar aún más la confiabilidad de nuestra atención al cliente, utilizamos un portal de autoservicio impulsado por IA. Este portal permite a los clientes acceder a la información, solucionar problemas y encontrar soluciones de forma independiente sin necesidad de interactuar directamente con un agente de soporte. En última instancia, esto permite a los clientes encontrar soluciones en sus propios términos y también libera a nuestro equipo de soporte para que se concentre en consultas más complejas. ",
    "Final thought": "Pensamiento final",
    "In summary, the integration of AI into our operations has proven to be immensely crucial in enhancing our customer service effectiveness. AI can automate tasks, aid in extensive data analysis, and enhance the reliability of our support team. Ultimately, this streamlines the process, allowing us to more efficiently and rapidly address the various challenges encountered by our customers. ": "En resumen, la integración de la IA en nuestras operaciones ha demostrado ser sumamente crucial para mejorar la eficacia de nuestro servicio al cliente. La IA puede automatizar tareas, ayudar en el análisis extenso de datos y mejorar la confiabilidad de nuestro equipo de soporte. En última instancia, esto agiliza el proceso, permitiéndonos abordar de manera más eficiente y rápida los diversos desafíos que enfrentan nuestros clientes. ",

    "Initial Support and Collaborative Evolution": "Soporte inicial y evolución colaborativa",
    "At the start of this project, we had to first assess the platform to identify the features that needed improvement. We realized that the existing features, while functional, required enhancements to provide their users with a seamless experience. Vehya faced challenges that are typical for companies on the brink of greatness – challenges that we were excited to tackle head-on. Our main goal was to improve the identified features to ensure optimal performance and user satisfaction. ": "Al comienzo de este proyecto, primero tuvimos que evaluar la plataforma para identificar las características que necesitaban mejoras. Nos dimos cuenta de que las características existentes, aunque funcionales, requerían mejoras para brindar a sus usuarios una experiencia perfecta. Vehya enfrentó desafíos que son típicos de las empresas al borde de la grandeza, desafíos que nos entusiasmó abordar de frente. Nuestro principal objetivo era mejorar las características identificadas para garantizar un rendimiento óptimo y la satisfacción del usuario.",
    "Transition to Manager Service Provider Plan": "Plan de Transición al Proveedor de Servicios de Gerente",
    "Due to the success we had in the first phase of the project, our client (Vehya) recognized our potential and decided to entrust us with an even greater responsibility – the Manager Service Provider Plan. This transition took our partnership to the next level – we were now actively contributing to shaping Vehya's strategic direction. To ensure the partnership was seamless, it was crucial to first align our expertise with their vision to provide the most effective and relevant solutions for their business challenges.  ": "Debido al éxito que tuvimos en la primera fase del proyecto, nuestro cliente (Vehya) reconoció nuestro potencial y decidió confiarnos una responsabilidad aún mayor: el Plan de Proveedor de Servicios Gerente. Esta transición llevó nuestra asociación al siguiente nivel: ahora contribuíamos activamente a dar forma a la dirección estratégica de Vehya. Para garantizar que la asociación fuera fluida, fue crucial alinear primero nuestra experiencia con su visión para brindar las soluciones más efectivas y relevantes para sus desafíos comerciales.",
    "Key Initiatives and Innovations": "Iniciativas e innovaciones clave",
    "Under the Manager Service Provider Plan, our teams embarked on a series of tasks that aimed at elevating Vehya's services. Some of the key tasks included streamlining the user interface and implementing advanced analytics. Each of these tasks was carefully executed to enrich the user experience and increase operational efficiency.  ": "Bajo el Plan de Proveedor de Servicios de Gerente, nuestros equipos se embarcaron en una serie de tareas que tenían como objetivo elevar los servicios de Vehya. Algunas de las tareas clave incluyeron la optimización de la interfaz de usuario y la implementación de análisis avanzados. Cada una de estas tareas se ejecutó cuidadosamente para enriquecer la experiencia del usuario y aumentar la eficiencia operativa. ",
    "Re-Architecting the System for Scalability": "Rediseñando el sistema para la escalabilidad",
    "The journey towards success is often accompanied by growth, and for Vehya, this meant addressing the challenge of scalability since its goal is to serve customers globally. We realized that their existing system was robust but needed re-architecting to accommodate the company's expanding user base. ": "El viaje hacia el éxito a menudo va acompañado de crecimiento y, para Vehya, esto significaba abordar el desafío de la escalabilidad, ya que su objetivo es servir a los clientes en todo el mundo. Nos dimos cuenta de que su sistema existente era sólido pero necesitaba una nueva arquitectura para adaptarse a la base de usuarios en expansión de la empresa.",
    "We worked with their team to redesign and restructure the system, ensuring it could handle increased demand without compromising performance. The goal was to create a more agile and responsive platform capable of handling the demands of Vehya's growing global presence, which we achieved. ": "Trabajamos con su equipo para rediseñar y reestructurar el sistema, asegurándonos de que pudiera manejar una mayor demanda sin comprometer el rendimiento. El objetivo era crear una plataforma más ágil y receptiva capaz de manejar las demandas de la creciente presencia global de Vehya, lo cual logramos.",
    "Expansion into Global Company Compliance Regulations": "Expansión a las Regulaciones de Cumplimiento de Compañías Globales",
    "Since Vehya’s goal was to serve customers globally, they needed to comply with international regulations. As the IT service provider, it was our role to help Vehya navigate the complex landscape of global compliance standards. This task involved paying attention to detail, ensuring that Vehya's services adhered to diverse regulations while maintaining a consistent user experience.  ": "Dado que el objetivo de Vehya era servir a los clientes a nivel mundial, debían cumplir con las regulaciones internacionales. Como proveedor de servicios de TI, nuestra función era ayudar a Vehya a navegar el complejo panorama de los estándares de cumplimiento global. Esta tarea involucró prestar atención a los detalles, asegurando que los servicios de Vehya se adhirieran a diversas regulaciones mientras mantuvieran una experiencia de usuario consistente.",
    "Conclusion": "Conclusión",
    "Overall, the project was a success, and we leave with a sense of pride as an IT company. While collaborating with Vehya, the cohesive synergy of our teams served as the driving force, highlighting the significance of effective communication, mutual respect, and the utilization of strengths. Additionally, we learned valuable lessons from this project, which our team will use to enhance the quality and effectiveness of our future collaborations with Vehya and other clients. ": "En general, el proyecto fue un éxito y nos vamos con un sentido de orgullo como empresa de TI. Mientras colaboraba con Vehya, la sinergia cohesiva de nuestros equipos sirvió como fuerza impulsora, destacando la importancia de la comunicación efectiva, el respeto mutuo y la utilización de las fortalezas. Además, aprendimos lecciones valiosas de este proyecto, que nuestro equipo utilizará para mejorar la calidad y la eficacia de nuestras futuras colaboraciones con Vehya y otros clientes.",

    "Understanding the Vision": "Comprender la visión",
    "Before getting into the weeds of the project, the first thing our team needed to do was to understand the vision of our client. This involved having several discussions with the Propsmarts team. As stated earlier, Propsmarts’s vision was to create an all-in-one platform to make it easier for their clients to buy and sell real estate properties like land. We had several brainstorming sessions with the Propsmarts team to gather requirements and ensure we had all requirements before getting started with the project.  ": "Antes de entrar en materia de proyecto, lo primero que nuestro equipo debía hacer era entender la visión de nuestro cliente. Esto implicó tener varias conversaciones con el equipo de Propsmarts. Como se indicó anteriormente, la visión de Propsmarts era crear una plataforma todo en uno para facilitar a sus clientes la compra y venta de propiedades inmobiliarias como terrenos. Tuvimos varias sesiones de lluvia de ideas con el equipo de Propsmarts para recopilar los requisitos y asegurarnos de que teníamos todos los requisitos antes de comenzar con el proyecto.",
    "Market Research and Analysis": "Investigación y análisis de mercado",
    "In order to create a product with a competitive edge, differentiation is key. That’s why we had to do thorough market research and analysis to create a product with unique features and capabilities to already existing products. However, we also had to ensure Propsmarts had all the core capabilities that its competitors offered. This phase of the project served as the compass guiding the product's development. ": "Para crear un producto con una ventaja competitiva, la diferenciación es clave. Es por eso que tuvimos que realizar una investigación y un análisis de mercado exhaustivos para crear un producto con características y capacidades únicas para los productos ya existentes. Sin embargo, también teníamos que asegurarnos de que Propsmarts tuviera todas las capacidades básicas que ofrecían sus competidores. Esta fase del proyecto sirvió como brújula para guiar el desarrollo del producto.",
    "Conceptualization and Design": "Conceptualización y Diseño",
    "Following the market analysis, our next step was to interpret the collected data and align it with the client's specifications. This allowed us to formulate a concept design for the project. Throughout this process, we maintained close collaboration with the client to ensure that the design matched their expectations. Additionally, we ensured the seamless integration of all the envisioned features and functionalities that Propsmarts was set to offer within this concept design. ": "Tras el análisis de mercado, nuestro siguiente paso fue interpretar los datos recopilados y alinearlos con las especificaciones del cliente. Esto nos permitió formular un diseño conceptual para el proyecto. A lo largo de este proceso, mantuvimos una estrecha colaboración con el cliente para garantizar que el diseño cumpliera con sus expectativas. Además, aseguramos la perfecta integración de todas las características y funcionalidades previstas que Propsmarts debía ofrecer dentro de este diseño conceptual.",
    "Development and Engineering": "Desarrollo e Ingeniería",
    "After the client approved the concept, it was time to get our hands dirty. The development process involved creating a robust backend infrastructure capable of handling data processing, analysis, and user interactions. We also had to create the user interface (front-end) of the platform and ensure it offers a seamless user experience, emphasizing usability and responsiveness. ": "Después de que el cliente aprobó el concepto, llegó el momento de ensuciarse las manos. El proceso de desarrollo involucró la creación de una sólida infraestructura de back-end capaz de manejar el procesamiento de datos, el análisis y las interacciones de los usuarios. También tuvimos que crear la interfaz de usuario (front-end) de la plataforma y asegurarnos de que ofrezca una experiencia de usuario perfecta, enfatizando la facilidad de uso y la capacidad de respuesta.",
    "Data Integration and Analysis": "Integración y análisis de datos",
    "When it comes to any property investment platform, the accessibility and integrity of data is crucial. With Propsmarts, we had to integrate several data sources to provide users with comprehensive property information, allowing them to make informed decisions. This involved creating algorithms to perform tasks such as property valuation, market trend analysis, and investment projections. ": "Cuando se trata de cualquier plataforma de inversión inmobiliaria, la accesibilidad y la integridad de los datos son cruciales. Con Propsmarts, tuvimos que integrar varias fuentes de datos para brindar a los usuarios información completa sobre la propiedad, lo que les permitió tomar decisiones informadas. Esto implicó la creación de algoritmos para realizar tareas como la valoración de propiedades, el análisis de tendencias del mercado y las proyecciones de inversión.",
    "Testing and fine-tuning the product": "Prueba y puesta a punto del producto.",
    "After building the product, it is crucial to ensure it works as intended; that’s why testing and fine-tuning were crucial. We did this through rigorous usability testing involving diverse potential users. We then used this feedback to fine-tune the user experience of the products by identifying and addressing performance bottlenecks and optimizing for speed and efficiency. ": "Después de construir el producto, es crucial asegurarse de que funcione según lo previsto; es por eso que las pruebas y los ajustes fueron cruciales. Hicimos esto a través de rigurosas pruebas de usabilidad que involucraron a diversos usuarios potenciales. Luego usamos estos comentarios para afinar la experiencia del usuario de los productos identificando y abordando los cuellos de botella en el rendimiento y optimizando la velocidad y la eficiencia.",
    "The creation of Propsmarts encompassed multiple processes, as detailed in this article. Throughout each stage, our team collaborated with the client to ensure we were on the right track regarding their requirements. Ultimately, the client loved the outcome, and our team also learned valuable lessons that we aim to incorporate into our future projects. We are grateful to Propsmarts for trusting us with this project. ": "La creación de Propsmarts abarcó múltiples procesos, como se detalla en este artículo. A lo largo de cada etapa, nuestro equipo colaboró con el cliente para garantizar que estuviéramos en el camino correcto con respecto a sus requisitos. En última instancia, al cliente le encantó el resultado y nuestro equipo también aprendió lecciones valiosas que pretendemos incorporar en nuestros proyectos futuros. Agradecemos a Propsmarts por confiarnos este proyecto. ",
    "Request a call": "Solicitar una llamada",
    "Fill out the form below and receive our free consultation": "Rellene el siguiente formulario y reciba nuestra consulta gratuita",
    "Sales": "Ventas",
    "Name": "Nombre *",
    "Email address": "Dirección de correo electrónico *",
    "Phone number": "Número de teléfono *",
    "Company Name": "Nombre de empresa *",
    "Some field is missing.": "Falta algún campo.",
    "Submit Request": "Enviar peticion",
    "Your message has been sent!": "¡Tu mensaje ha sido enviado!",
    "Interest": "Interés",
    "Thank you for sending us a message. One of our experts touch in the next 24-48 hours!": "Gracias por enviarnos un mensaje. ¡Uno de nuestros expertos toca en las próximas 24-48 horas!",

    "Email field is required.": "El campo de correo electrónico es obligatorio.",
    "Invalid email format.": "Formato de correo electrónico no válido.",
    "Name field is required.": "El campo de nombre es obligatorio.",
    "Interest field is required.": "El campo de interés es obligatorio.",
    "Company Name field is required.": "El campo Nombre de la empresa es obligatorio.",
    "PhoneNumber field is required.": "El campo PhoneNumber es obligatorio.",
    "Invalid phone number format.": "Formato de número de teléfono no válido.",

    "25 July 2023": "25 Julio 2023",
    "30 June 2023": "30 Junio 2023",
    "30 April 2023": "30 Abril 2023"
}