{

    "navLinks.home": "Σπίτι",
    "navLinks.work": "Η δουλειά μας",
    "navLinks.careers": "Καριέρες",
    "navLinks.contact": "Επικοινωνήστε μαζί μας",
    "contact us": "Επικοινωνήστε μαζί μας",
    "Use technology to your advantage": "Χρησιμοποιήστε την τεχνολογία προς όφελός σας",
    "Experience our unwavering commitment to delivering exceptional IT solutions with integrity and transparency": "Ζήστε την ακλόνητη δέσμευσή μας να παρέχουμε εξαιρετικές λύσεις πληροφορικής με ακεραιότητα και διαφάνεια",
    "Book Free Consultation": "Βιβλίο Δωρεάν Συμβουλευτική",
    "About Us": "Σχετικά με εμάς",
    "As the world evolves and technological advances increase, businesses face the challenge of keeping processes and systems up to date, replacing legacy systems with newer tech. Companies worldwide rely on emerging technologies to drive strategy and growth, giving them a competitive edge.": "Καθώς ο κόσμος εξελίσσεται και η τεχνολογική πρόοδος αυξάνεται, οι επιχειρήσεις αντιμετωπίζουν την πρόκληση να διατηρούν τις διαδικασίες και τα συστήματα ενημερωμένα, αντικαθιστώντας τα παλαιού τύπου συστήματα με νεότερη τεχνολογία. Οι εταιρείες παγκοσμίως βασίζονται σε αναδυόμενες τεχνολογίες για να προωθήσουν τη στρατηγική και την ανάπτυξη, δίνοντάς τους ανταγωνιστικό πλεονέκτημα.",
    "At March, we help companies incorporate the latest technologies into their business models and provide a seamless experience to customers while building strategic models that define the best ways to sell, upsell, and cross-sell products.": "Τον Μάρτιο, βοηθάμε τις εταιρείες να ενσωματώσουν τις πιο πρόσφατες τεχνολογίες στα επιχειρηματικά τους μοντέλα και να προσφέρουν μια απρόσκοπτη εμπειρία στους πελάτες, ενώ παράλληλα χτίζουν στρατηγικά μοντέλα που καθορίζουν τους καλύτερους τρόπους πώλησης, ανωθήρων και πολλαπλών πωλήσεων προϊόντων.",
    "Our Vision": "Το όραμά μας",
    "At Marchcroft, we solve  business problems with technology. Whether that is building a new product, improving existing processes or helping companies become digitally connected. We focus on creating economic growth through strategic assessment of our client needs, providing operational support, ensuring operational excellence and guaranteeing the security of confidential information and trade advantages.": "Στη Marchcroft, επιλύουμε επιχειρηματικά προβλήματα με την τεχνολογία. Είτε αυτό είναι η δημιουργία ενός νέου προϊόντος, είτε η βελτίωση των υπαρχουσών διαδικασιών είτε η παροχή βοήθειας στις εταιρείες να συνδεθούν ψηφιακά. Εστιάζουμε στη δημιουργία οικονομικής ανάπτυξης μέσω της στρατηγικής αξιολόγησης των αναγκών των πελατών μας, παρέχοντας επιχειρησιακή υποστήριξη, διασφαλίζοντας τη λειτουργική αριστεία και διασφαλίζοντας την ασφάλεια των εμπιστευτικών πληροφοριών και τα εμπορικά πλεονεκτήματα.",
    "Our Solutions": "Οι Λύσεις μας",
    "Introducing our Comprehensive Solutions Suite": "Παρουσιάζουμε τη σουίτα ολοκληρωμένων λύσεων",
    "Increase Delivery Times": "Αυξήστε τους χρόνους παράδοσης",
    "Utilizing technology-driven solutions to expedite delivery processes, enabling swift and efficient product or service distribution": "Χρήση λύσεων που βασίζονται στην τεχνολογία για την επιτάχυνση των διαδικασιών παράδοσης, επιτρέποντας γρήγορη και αποτελεσματική διανομή προϊόντων ή υπηρεσιών",
    "Greenfield Projects": "Γκρίνφιλντ Εργα",
    "Leveraging technology to pioneer new ventures, ignite innovation, and embark on fresh and transformative business endeavors": "Αξιοποιώντας την τεχνολογία για να πρωτοπορήσουμε σε νέα εγχειρήματα, να πυροδοτήσουμε την καινοτομία και να ξεκινήσουμε νέες και μετασχηματιστικές επιχειρηματικές προσπάθειες",
    "Performance & Cost": "Απόδοση & Κόστος",
    "Harnessing technology to enhance business efficiency, streamline processes, and reduce costs, driving optimal performance": "Αξιοποιώντας την τεχνολογία για τη βελτίωση της επιχειρηματικής αποδοτικότητας, τον εξορθολογισμό των διαδικασιών και τη μείωση του κόστους, οδηγώντας τη βέλτιστη απόδοση",
    "Scalable Products": "Κλιμακόμενα προϊόντα",
    "Leveraging technology’s scalability to create adaptable and flexible products, ensuring seamless growth and future-proofing businesses": "Αξιοποιώντας την επεκτασιμότητα της τεχνολογίας για τη δημιουργία προσαρμόσιμων και ευέλικτων προϊόντων, διασφαλίζοντας απρόσκοπτη ανάπτυξη και μελλοντικές επιχειρήσεις",
    "Eco-Friendly Solutions": "Λύσεις φιλικές προς το περιβάλλον",
    "Utilizing technology to enhance interactions, personalize offerings, and create memorable customer journeys, elevating satisfaction levels": "Χρήση τεχνολογίας για τη βελτίωση των αλληλεπιδράσεων, την εξατομίκευση των προσφορών και τη δημιουργία αξέχαστων ταξιδιών πελατών, αυξάνοντας τα επίπεδα ικανοποίησης",
    "Increase ROI": "Αυξήστε την απόδοση επένδυσης (ROI).",
    "Harness tech to develop environmentally conscious and sustainable solutions, fostering greener approach to business practices": "Αξιοποιήστε την τεχνολογία για να αναπτύξετε περιβαλλοντικά συνειδητές και βιώσιμες λύσεις, προωθώντας μια πιο πράσινη προσέγγιση στις επιχειρηματικές πρακτικές",
    "Services We Offer": "Υπηρεσίες που Προσφέρουμε",
    "A quick intro of the services we offer at Marchcroft": "Μια γρήγορη εισαγωγή των υπηρεσιών που προσφέρουμε στο Marchcroft",
    "Strategic Consultancy": "Στρατηγική Συμβουλευτική",
    "Our dependable client teams pinpoint problem areas and recommend services or goods that can help with business requirements. We focus on discovering customer value and increasing interest return on digital solutions. Based on market-leading frameworks, we customise solutions to fit unique customer demands.Our dependable client teams pinpoint problem areas and recommend services or goods that can help with business requirements. We focus on discovering customer value and increasing interest return on digital solutions. Based on market-leading frameworks, we customise solutions to fit unique customer demands.": "Οι αξιόπιστες ομάδες πελατών μας εντοπίζουν προβληματικές περιοχές και προτείνουν υπηρεσίες ή αγαθά που μπορούν να βοηθήσουν στις επιχειρηματικές απαιτήσεις. Εστιάζουμε στην ανακάλυψη της αξίας των πελατών και στην αύξηση της απόδοσης ενδιαφέροντος για ψηφιακές λύσεις. Βασισμένοι σε κορυφαία πλαίσια της αγοράς, προσαρμόζουμε λύσεις για να ανταποκρίνονται στις μοναδικές απαιτήσεις των πελατών. Οι αξιόπιστες ομάδες πελατών μας εντοπίζουν προβληματικές περιοχές και προτείνουν υπηρεσίες ή προϊόντα που μπορούν να βοηθήσουν στις επιχειρηματικές απαιτήσεις. Εστιάζουμε στην ανακάλυψη της αξίας των πελατών και στην αύξηση της απόδοσης ενδιαφέροντος για ψηφιακές λύσεις. Με βάση κορυφαία πλαίσια της αγοράς, προσαρμόζουμε λύσεις για να ανταποκρίνονται στις μοναδικές απαιτήσεις των πελατών.",
    "Software Architecture & Infrastructure": "Αρχιτεκτονική & Υποδομή Λογισμικού",
    "Enhancing and implementing key software elements that support business operations, finance, and security within the organisation. We focus on speeding up the digital transformation process, mitigating risk, scaling quickly, and bringing business and IT together.": "Βελτίωση και εφαρμογή βασικών στοιχείων λογισμικού που υποστηρίζουν τις επιχειρηματικές λειτουργίες, τη χρηματοδότηση και την ασφάλεια εντός του οργανισμού. Εστιάζουμε στην επιτάχυνση της διαδικασίας ψηφιακού μετασχηματισμού, στον μετριασμό του κινδύνου, στην ταχεία κλιμάκωση και στη συνένωση επιχειρήσεων και πληροφορικής.",
    "Digital Transformation": "Ψηφιακός Μετασχηματισμός",
    "We help our clients to be more digitally connected, accelerate the delivery of products and increase the return on interest. Our approach is to employ agile culture and mindset, building cross-functional teams and guaranteeing success through data metrics.": "Βοηθάμε τους πελάτες μας να είναι πιο ψηφιακά συνδεδεμένοι, να επιταχύνουμε την παράδοση των προϊόντων και να αυξήσουμε την απόδοση των τόκων. Η προσέγγισή μας είναι να χρησιμοποιήσουμε ευέλικτη κουλτούρα και νοοτροπία, να δημιουργήσουμε ομάδες πολλαπλών λειτουργιών και να εγγυηθούμε την επιτυχία μέσω μετρήσεων δεδομένων.",
    "Engineering and Technology": "Μηχανική και Τεχνολογία",
    "Utilise cutting-edge technologies to give the business a competitive edge. We help our clients to ensure they are keeping up to date with tech. Better performing system, insights to data and securing of assets and competitive advantages.": "Χρησιμοποιήστε τεχνολογίες αιχμής για να δώσετε στην επιχείρηση ανταγωνιστικό πλεονέκτημα. Βοηθάμε τους πελάτες μας να διασφαλίσουν ότι είναι ενημερωμένοι με την τεχνολογία. Σύστημα καλύτερης απόδοσης, πληροφορίες για τα δεδομένα και διασφάλιση περιουσιακών στοιχείων και ανταγωνιστικών πλεονεκτημάτων.",
    "UX Design": "UX Σχέδιο",
    "To create the best User Experience (UX) strategy, it is essential to match your business goals with your clients. Our team conducts research to develop a tailored and cohesive experience that is aligned with your overall brand stance. Our team thoroughly tests with users at each step of the process for product success. Company reputation is our aim, focusing on what matters to customers and providing our clients with a competitive advantage.": "Για να δημιουργήσετε την καλύτερη στρατηγική Εμπειρίας Χρήστη (UX), είναι απαραίτητο να ταιριάξετε τους επιχειρηματικούς σας στόχους με τους πελάτες σας. Η ομάδα μας διεξάγει έρευνα για να αναπτύξει μια εξατομικευμένη και συνεκτική εμπειρία που να ευθυγραμμίζεται με τη συνολική στάση της επωνυμίας σας. Η ομάδα μας δοκιμάζει διεξοδικά με τους χρήστες σε κάθε βήμα της διαδικασίας για την επιτυχία του προϊόντος. Στόχος μας είναι η φήμη της εταιρείας, η εστίαση σε ό,τι έχει σημασία για τους πελάτες και η παροχή στους πελάτες μας ανταγωνιστικού πλεονεκτήματος.",
    "Cloud": "Σύννεφο",
    "Building resilience in software architecture can be achieved through cloud technology. Our teams focus on building organisational agility, implementing delivery pipelines and high service availability, therefore driving growth.": "Η οικοδόμηση ανθεκτικότητας στην αρχιτεκτονική λογισμικού μπορεί να επιτευχθεί μέσω της τεχνολογίας cloud. Οι ομάδες μας επικεντρώνονται στην ανάπτυξη οργανωτικής ευελιξίας, στην υλοποίηση αγωγών παράδοσης και στην υψηλή διαθεσιμότητα υπηρεσιών, οδηγώντας επομένως στην ανάπτυξη.",
    "How We Work": "Πώς εργαζόμαστε",
    "A deep dive on how we work with our clients and our work process": "Μια βαθιά κατάδυση σχετικά με τον τρόπο με τον οποίο συνεργαζόμαστε με τους πελάτες μας και τη διαδικασία εργασίας μας",
    "Understand your problems": "Κατανοήστε τα προβλήματά σας",
    "Our experts will develop a strategic solution, including architecture designs and mockup": "Οι ειδικοί μας θα αναπτύξουν μια στρατηγική λύση, συμπεριλαμβανομένων αρχιτεκτονικών σχεδίων και μακέτας",
    "Agile Work Cycle": "Ευκίνητος Κύκλος Εργασίας",
    "Your product is being worked on. get frequent updates during the delivery cycle": "Το προϊόν σας βρίσκεται υπό επεξεργασία. λαμβάνετε συχνές ενημερώσεις κατά τη διάρκεια του κύκλου παράδοσης",
    "Go live": "Μεταβείτε ζωντανά",
    "We will be there to support you even after completion day": "Θα είμαστε εκεί για να σας υποστηρίξουμε ακόμα και μετά την ημέρα ολοκλήρωσης",
    "Success": "Επιτυχία",
    "We make sure your product is top-notch and drive revenue": "Διασφαλίζουμε ότι το προϊόν σας είναι κορυφαίο και αυξάνει τα έσοδα",
    "Our Technology Stack": "Η στοίβα τεχνολογίας μας",
    "Our tech stack drives digital transformation, empowering businesses wth cutting-edge tools and platforms. From robust backends to seamless user experience, we deliver scalable, secure, and efficient solutions": "Η στοίβα τεχνολογίας μας οδηγεί στον ψηφιακό μετασχηματισμό, ενδυναμώνοντας τις επιχειρήσεις με εργαλεία και πλατφόρμες αιχμής. Από ισχυρά backend μέχρι απρόσκοπτη εμπειρία χρήστη, παρέχουμε επεκτάσιμες, ασφαλείς και αποτελεσματικές λύσεις",
    "Our Work": "Η δουλειά μας",
    "See what our customers have to say about working with us": "Δείτε τι έχουν να πουν οι πελάτες μας για τη συνεργασία μαζί μας",
    "I’ve been using Marchcroft for two months now. Aside their exceptional   business services their customer services is peak and lovely! Looking forward to get more things done with the wonderful team": "Χρησιμοποιώ το Marchcroft εδώ και δύο μήνες. Εκτός από τις εξαιρετικές επιχειρηματικές τους υπηρεσίες, οι υπηρεσίες πελατών τους είναι κορυφαίες και υπέροχες! Ανυπομονώ να κάνουμε περισσότερα πράγματα με την υπέροχη ομάδα",
    "- P Williams, Securely": "- P Williams, ασφαλώς",
    "I'm highly impressed with Marchcroft consulting. Their expertise, clear communication, and efficient implementation resulted in a solution that exceeded our expectations. They're a top-notch partner for software consulting.": "Είμαι πολύ εντυπωσιασμένος με τις συμβουλές Marchcroft. Η τεχνογνωσία, η σαφής επικοινωνία και η αποτελεσματική εφαρμογή τους οδήγησαν σε μια λύση που ξεπέρασε τις προσδοκίες μας. Είναι κορυφαίος συνεργάτης για συμβουλές λογισμικού.",
    "- James Hardy, Coinclustr": "- James Hardy, Coinclustr",
    " A valuable partner that consistently goes above and beyond.": "Ένας πολύτιμος συνεργάτης που με συνέπεια πάει πάνω και πέρα.",
    "- Marc Consulting": "- Marc Consulting",
    "Talk to Us": "Μίλησέ μας",
    "Get in touch to discuss your digital ambitions. We can help you achieve them": "Επικοινωνήστε για να συζητήσετε τις ψηφιακές σας φιλοδοξίες. Μπορούμε να σας βοηθήσουμε να τα πετύχετε",
    "Compliance services": "Υπηρεσίες συμμόρφωσης",
    "Privacy": "Μυστικότητα",
    "Terms of service": "Οροι χρήσης",
    "Get In Touch": "Ερχομαι σε επαφή",
    "Recent blog posts": "Πρόσφατες αναρτήσεις ιστολογίου",
    "Load More": "Φόρτωσε περισσότερα",
    "Read more": "Διαβάστε περισσότερα",
    "How We Use Artificial Intelligence to Improve Customer Service": "Πώς χρησιμοποιούμε την τεχνητή νοημοσύνη για να βελτιώσουμε την εξυπηρέτηση πελατών",
    "Artificial intelligence (AI) is one of the revolutionary technologies that has had an impact on several industries in the last few years. As an IT company, we have integrated AI into many of our workflows to streamline operations and enhance our effectiveness and productivity. To help you understand how we leverage the power of AI, this article will explore some of the ways we use it to enhance customer service. ": "Η τεχνητή νοημοσύνη (AI) είναι μια από τις επαναστατικές τεχνολογίες που είχε αντίκτυπο σε πολλές βιομηχανίες τα τελευταία χρόνια. Ως εταιρεία πληροφορικής, έχουμε ενσωματώσει την τεχνητή νοημοσύνη σε πολλές από τις ροές εργασίας μας για να βελτιώσουμε τις λειτουργίες και να βελτιώσουμε την αποτελεσματικότητα και την παραγωγικότητά μας. Για να σας βοηθήσουμε να κατανοήσετε πώς αξιοποιούμε τη δύναμη της τεχνητής νοημοσύνης, αυτό το άρθρο θα διερευνήσει μερικούς από τους τρόπους που τη χρησιμοποιούμε για να βελτιώσουμε την εξυπηρέτηση πελατών.",
    "Work we have done for Vehya": "Δουλειά που έχουμε κάνει για τη Vehya",
    "At Marchcroft, our vision is to utilize cutting-edge technologies to assist businesses in streamlining their operations, thereby enhancing efficiency and productivity. In one of our recent projects, we collaborated with Vehya, a marketplace for electrification products, to enhance various existing features on their platform.  This article aims to provide you with comprehensive insights into this project, including the various tasks we handled during this project. Without further ado, let's delve in right away!": "Στη Marchcroft, το όραμά μας είναι να χρησιμοποιήσουμε τεχνολογίες αιχμής για να βοηθήσουμε τις επιχειρήσεις να εξορθολογίσουν τις δραστηριότητές τους, ενισχύοντας έτσι την αποτελεσματικότητα και την παραγωγικότητα. Σε ένα από τα πρόσφατα έργα μας, συνεργαστήκαμε με την Vehya, μια αγορά για προϊόντα ηλεκτροκίνησης, για να βελτιώσουμε διάφορα υπάρχοντα χαρακτηριστικά στην πλατφόρμα τους. Αυτό το άρθρο στοχεύει να σας παρέχει ολοκληρωμένες πληροφορίες σχετικά με αυτό το έργο, συμπεριλαμβανομένων των διαφόρων εργασιών που χειριστήκαμε κατά τη διάρκεια αυτού του έργου. Χωρίς άλλη καθυστέρηση, ας εμβαθύνουμε αμέσως!",
    "Creating a Property Investment Tool from Scratch": "Δημιουργία εργαλείου επένδυσης σε ακίνητα από την αρχή",
    "At Marchcroft, we develop products for businesses in various industries, including Fintech. With this project, we were tasked with developing Propsmarts – a comprehensive property investment tool that allows users to buy or sell real estate properties, such as land, all on one platform. In this article, we will walk you through the process we went through while handling this project. Let’s dive right in! ": "Στη Marchcroft, αναπτύσσουμε προϊόντα για επιχειρήσεις σε διάφορους κλάδους, συμπεριλαμβανομένης της Fintech. Με αυτό το έργο, μας ανατέθηκε η ανάπτυξη του Propsmarts – ενός ολοκληρωμένου επενδυτικού εργαλείου σε ακίνητα που επιτρέπει στους χρήστες να αγοράζουν ή να πουλούν ακίνητα, όπως γη, όλα σε μία πλατφόρμα. Σε αυτό το άρθρο, θα σας καθοδηγήσουμε στη διαδικασία που ακολουθήσαμε κατά τη διαχείριση αυτού του έργου. Ας βουτήξουμε αμέσως!",
    "Open roles": "Ανοιχτοί ρόλοι",
    "Competencies": "Αρμοδιότητες",
    "Experience required": "Απαιτείται εμπειρία",
    "Location": "Τοποθεσία",
    "Careers": "Καριέρες",

    "Senior Full Stack Software Engineer": "Ανώτερος Μηχανικός Λογισμικού Full Stack",
    "Are you a passionate Senior Full Stack Engineer seeking a new opportunity to work on innovative projects? Join our team and make an impact on cutting-edge technologies!": "Είστε παθιασμένος Senior Full Stack Engineer που αναζητάτε μια νέα ευκαιρία να εργαστείτε σε καινοτόμα έργα; Γίνετε μέλος της ομάδας μας και ασκήστε αντίκτυπο σε τεχνολογίες αιχμής!",
    "Competitive £/hr": "Ανταγωνιστικός £/hr",
    "We are looking for an enthusiastic and inquisitive individual who can think creatively to solve problems and meet user requirements. You must have a keen interest in software requirements and have a keen interest in sofware engineering and be ready to research and learn new techniques, languages and frameworks. Working with a DevSecOps mindset, you will be developing, delivering and operating applications using a secure approach.": "Αναζητούμε ένα ενθουσιώδες και περίεργο άτομο που μπορεί να σκέφτεται δημιουργικά για να λύνει προβλήματα και να ανταποκρίνεται στις απαιτήσεις των χρηστών. Πρέπει να έχετε έντονο ενδιαφέρον για τις απαιτήσεις λογισμικού και να έχετε έντονο ενδιαφέρον για τη μηχανική λογισμικού και να είστε έτοιμοι να ερευνήσετε και να μάθετε νέες τεχνικές, γλώσσες και πλαίσια. Δουλεύοντας με μια νοοτροπία DevSecOps, θα αναπτύσσετε, θα παραδίδετε και θα χειρίζεστε εφαρμογές χρησιμοποιώντας μια ασφαλή προσέγγιση.",
    "Contributing to the development and refinement of user requirements.": "Συμβολή στην ανάπτυξη και βελτίωση των απαιτήσεων των χρηστών.",
    "Actively contribute to Scrum ceremonies such as Refinement, Sprint Planning and Retrospective.": "Συνεισφέρετε ενεργά σε τελετές Scrum όπως το Refinement, το Sprint Planning και το Retrospective.",
    "Designing innovative solutions to solve problems and meet requirements.": "Σχεδιασμός καινοτόμων λύσεων για την επίλυση προβλημάτων και την κάλυψη των απαιτήσεων.",
    "Elaborate solutions at a high level and create low level designs that conforms to set standards.": "Επεξεργαστείτε λύσεις σε υψηλό επίπεδο και δημιουργήστε σχέδια χαμηλού επιπέδου που συμμορφώνονται με τα καθορισμένα πρότυπα.",
    "Communicate effectively to a variety of audiences including both technical and non-technical stakeholders.": "Επικοινωνήστε αποτελεσματικά με ποικίλα ακροατήρια, συμπεριλαμβανομένων τόσο τεχνικών όσο και μη τεχνικών ενδιαφερομένων.",
    "Leading Demo Sessions as part of sprint reviews.": "Κορυφαίες συνεδρίες επίδειξης ως μέρος κριτικών sprint.",
    "Implementing solutions using a variety of programming languages, frameworks, tools and techniques.": "Εφαρμογή λύσεων χρησιμοποιώντας μια ποικιλία γλωσσών προγραμματισμού, πλαισίων, εργαλείων και τεχνικών.",
    "Encourage and practice TDD and other Delivery Best practices.": "Ενθαρρύνετε και εξασκήστε το TDD και άλλες βέλτιστες πρακτικές παράδοσης.",
    "Producing applicable technical documentation.": "Παραγωγή της ισχύουσας τεχνικής τεκμηρίωσης.",
    "Contribute to improvements of our technical excellence and ways of working within Squad, Chapter and Guild forums.": "Συνεισφέρετε στις βελτιώσεις της τεχνικής μας αριστείας και των τρόπων εργασίας στα φόρουμ Squad, Chapter και Guild.",
    "Actively Contribute to and progress the technical roadmap.": "Συνεισφέρετε ενεργά στον τεχνικό χάρτη πορείας και προωθήστε τον.",
    "Mentoring Software Engineers, Graduate and Junior population.": "Καθοδήγηση Μηχανικών Λογισμικού, Πτυχιούχων και Νέων πληθυσμού.",
    "Address Technical Debt and consistently recommend Continuous Improvement initiatives.": "Αντιμετωπίστε το Τεχνικό Χρέος και προτείνετε με συνέπεια πρωτοβουλίες Συνεχούς Βελτίωσης.",
    "Competent in DevOps approach and practices.": "Ικανός στην προσέγγιση και τις πρακτικές DevOps.",
    "Identification and ownership of NFRs.": "Αναγνώριση και ιδιοκτησία των NFR.",
    "Actively encourage and provide knowledge transfer during the delivery stride.": "Ενθαρρύνετε ενεργά και παρέχετε μεταφορά γνώσης κατά τη διάρκεια του βήματος παράδοσης.",

    "Experience developing, implementing, and maintaining applications written in either of Java, Kotlin or Python.": "Εμπειρία ανάπτυξης, υλοποίησης και διατήρησης εφαρμογών γραμμένων σε Java, Kotlin ή Python.",
    "Web services development experience using spring boot or similar.":"Εμπειρία ανάπτυξης υπηρεσιών ιστού με χρήση ελατηρίου ή παρόμοιο.",
    "Web development experience using HTML, CSS and a JavaScript/TypeScript framework, preferably Angular 2+.": "Εμπειρία ανάπτυξης ιστού χρησιμοποιώντας HTML, CSS και πλαίσιο JavaScript/TypeScript, κατά προτίμηση Angular 2+.",
    "Experience with SQL and relational database technologies such as PostgreSQL, MySQL or MS SQL.": "Εμπειρία με SQL και τεχνολογίες σχεσιακών βάσεων δεδομένων όπως PostgreSQL, MySQL ή MS SQL.",
    "Experience with development tools such as Git, Maven, npm etc." : "Εμπειρία με εργαλεία ανάπτυξης όπως Git, Maven, npm κ.λπ.",
    "Experience with Cloud technologies (Google Cloud Platform preferred but others would be considered).": "Εμπειρία με τεχνολογίες Cloud (προτιμάται η πλατφόρμα Google Cloud αλλά θα λαμβάνονται υπόψη άλλες).",
    "Experience with CI/CD pipelines, ideally Azure DevOps.": "Εμπειρία με αγωγούς CI/CD, ιδανικά Azure DevOps.",
    "Experience with Service Mesh Technologies preferably Istio or Anthos": "Εμπειρία με Service Mesh Technologies κατά προτίμηση Istio ή Anthos",
    "Experience with Docker, Kubernetes, Helm, or Terraform.": "Εμπειρία με Docker, Kubernetes, Helm ή Terraform.",
    "Experience with BigQuery is an added advantage.": "Η εμπειρία με το BigQuery αποτελεί πρόσθετο πλεονέκτημα.",
    "A good mix of the competencies mentioned above is required for the candidate to be successful within a squad in Data Tribe. The squad will contain engineers with similar profile with various areas of expertise. The senior is expected to make use of these expertise areas to arrive at a solution that can be built, delivered and operated in a productionized environment.": "Απαιτείται ένας καλός συνδυασμός των ικανοτήτων που αναφέρονται παραπάνω για να είναι επιτυχής ο υποψήφιος σε μια ομάδα στο Data Tribe. Η ομάδα θα περιλαμβάνει μηχανικούς με παρόμοιο προφίλ με διάφορους τομείς εξειδίκευσης. Ο ανώτερος υπάλληλος αναμένεται να κάνει χρήση αυτών των τομέων εξειδίκευσης για καταλήξουμε σε μια λύση που μπορεί να κατασκευαστεί, να παραδοθεί και να λειτουργήσει σε ένα παραγωγικό περιβάλλον.",
    "This role can be offered on a hybrid or fully remote working basis.": "Αυτός ο ρόλος μπορεί να προσφερθεί σε υβριδική ή πλήρως απομακρυσμένη εργασία.",

    "More advanced chatbot-based support": "Πιο προηγμένη υποστήριξη που βασίζεται σε chatbot",
    "Recent advancements in AI technology have greatly improved the effectiveness of chatbots for customer support. With enhanced natural language processing, chatbots can now provide accurate and reliable solutions to a wide range of customer questions. This has made customers more comfortable interacting with chatbots, as they can expect precise solutions to their problems. As a result, chatbots can now handle simple and common inquiries, allowing human support agents to focus on more complex tasks. ": "Οι πρόσφατες εξελίξεις στην τεχνολογία AI έχουν βελτιώσει σημαντικά την αποτελεσματικότητα των chatbot για την υποστήριξη πελατών. Με βελτιωμένη επεξεργασία φυσικής γλώσσας, τα chatbots μπορούν πλέον να παρέχουν ακριβείς και αξιόπιστες λύσεις σε ένα ευρύ φάσμα ερωτήσεων πελατών. Αυτό έχει κάνει τους πελάτες πιο άνετα να αλληλεπιδρούν με chatbot, καθώς μπορούν να περιμένουν ακριβείς λύσεις στα προβλήματά τους. Ως αποτέλεσμα, τα chatbots μπορούν πλέον να χειρίζονται απλές και κοινές ερωτήσεις, επιτρέποντας στους πράκτορες ανθρώπινης υποστήριξης να εστιάζουν σε πιο σύνθετες εργασίες. ",
    "Personalized Interactions": "Εξατομικευμένες αλληλεπιδράσεις",
    "By using AI algorithms, it is now much easier for us to analyze a customer's historical data and behavior to gain insights into their preferences, purchase history, and past interactions with our company. Armed with this information, our teams can easily provide recommendations, offers, and solutions that are relevant to the customer. This level of personalization not only enhances customer engagement but also makes customers feel valued and understood by our company. ": "Χρησιμοποιώντας αλγόριθμους AI, είναι πλέον πολύ πιο εύκολο για εμάς να αναλύσουμε τα ιστορικά δεδομένα και τη συμπεριφορά ενός πελάτη για να αποκτήσουμε πληροφορίες για τις προτιμήσεις του, το ιστορικό αγορών και τις προηγούμενες αλληλεπιδράσεις με την εταιρεία μας. Οπλισμένες με αυτές τις πληροφορίες, οι ομάδες μας μπορούν εύκολα να παρέχουν συστάσεις, προσφορές και λύσεις που σχετίζονται με τον πελάτη. Αυτό το επίπεδο εξατομίκευσης όχι μόνο ενισχύει την αφοσίωση των πελατών, αλλά επίσης κάνει τους πελάτες να αισθάνονται ότι τους εκτιμούν και τους κατανοούν η εταιρεία μας. ",
    "Predictive Analytics": "Προφητικός Analytics",
    "Making future predictions has become much easier than ever, thanks to advancements in AI and data analytics. Leveraging AI-driven predictive analytics, which involves using historical customer data and patterns to anticipate future needs and behaviors enables us to offer solutions or assistance ahead of time. For instance, our systems can predict customers' needs based on their previous interactions and automatically recommend one of our services to them. ": "Η πραγματοποίηση μελλοντικών προβλέψεων έχει γίνει πολύ πιο εύκολη από ποτέ, χάρη στις εξελίξεις στην τεχνητή νοημοσύνη και στην ανάλυση δεδομένων. Η αξιοποίηση των προγνωστικών αναλύσεων που βασίζονται στην τεχνητή νοημοσύνη, η οποία περιλαμβάνει τη χρήση ιστορικών δεδομένων και προτύπων πελατών για την πρόβλεψη μελλοντικών αναγκών και συμπεριφορών, μας δίνει τη δυνατότητα να προσφέρουμε λύσεις ή βοήθεια εκ των προτέρων. Για παράδειγμα, τα συστήματά μας μπορούν να προβλέψουν τις ανάγκες των πελατών με βάση τις προηγούμενες αλληλεπιδράσεις τους και να τους προτείνουν αυτόματα μία από τις υπηρεσίες μας. ",
    "Data-Driven decision": "Απόφαση βάσει δεδομένων",
    "Effective decision-making can significantly influence a company's service delivery. Through the utilization of AI analytics on customer data, we can extract valuable insights about trends, preferences, and areas of concern. These insights empower our team to make well-informed decisions to enhance our customers' experience. ": "Η αποτελεσματική λήψη αποφάσεων μπορεί να επηρεάσει σημαντικά την παροχή υπηρεσιών μιας εταιρείας. Μέσω της χρήσης αναλυτικών στοιχείων AI σε δεδομένα πελατών, μπορούμε να εξαγάγουμε πολύτιμες πληροφορίες σχετικά με τις τάσεις, τις προτιμήσεις και τους τομείς ανησυχίας. Αυτές οι πληροφορίες δίνουν τη δυνατότητα στην ομάδα μας να λαμβάνει καλά ενημερωμένες αποφάσεις για να βελτιώσει την εμπειρία των πελατών μας. ",
    "For instance, our systems can analyze data about project delivery times, pinpointing gaps in our service provision. This helps in making the right choice when determining how we can improve the way we deal with client projects.": "Για παράδειγμα, τα συστήματά μας μπορούν να αναλύσουν δεδομένα σχετικά με τους χρόνους παράδοσης έργων, εντοπίζοντας κενά στην παροχή υπηρεσιών μας. Αυτό βοηθά στη σωστή επιλογή κατά τον καθορισμό του τρόπου με τον οποίο μπορούμε να βελτιώσουμε τον τρόπο που αντιμετωπίζουμε τα έργα πελατών.",
    "Self-Service Portals": "Πύλες αυτοεξυπηρέτησης",
    "To further enhance our customer support reliability, we use an AI-powered self-service portal. This portal allows customers to access information, troubleshoot problems, and find solutions independently without needing direct interaction with a support agent. Ultimately, this allows customers to find solutions on their own terms and also frees up our support team to focus on more complex inquiries. ": "Για να βελτιώσουμε περαιτέρω την αξιοπιστία της υποστήριξης πελατών μας, χρησιμοποιούμε μια πύλη αυτοεξυπηρέτησης με τεχνητή νοημοσύνη. Αυτή η πύλη επιτρέπει στους πελάτες να έχουν πρόσβαση σε πληροφορίες, να αντιμετωπίζουν προβλήματα και να βρίσκουν λύσεις ανεξάρτητα χωρίς να χρειάζονται άμεση αλληλεπίδραση με έναν αντιπρόσωπο υποστήριξης. Τελικά, αυτό επιτρέπει στους πελάτες να βρίσκουν λύσεις με τους δικούς τους όρους και επίσης απελευθερώνει την ομάδα υποστήριξής μας να επικεντρωθεί σε πιο σύνθετες ερωτήσεις. ",
    "Final thought": "Τελική σκέψη",
    "In summary, the integration of AI into our operations has proven to be immensely crucial in enhancing our customer service effectiveness. AI can automate tasks, aid in extensive data analysis, and enhance the reliability of our support team. Ultimately, this streamlines the process, allowing us to more efficiently and rapidly address the various challenges encountered by our customers. ": "Συνοπτικά, η ενσωμάτωση της τεχνητής νοημοσύνης στις δραστηριότητές μας έχει αποδειχθεί εξαιρετικά σημαντική για τη βελτίωση της αποτελεσματικότητας της εξυπηρέτησης πελατών μας. Το AI μπορεί να αυτοματοποιήσει εργασίες, να βοηθήσει στην εκτεταμένη ανάλυση δεδομένων και να ενισχύσει την αξιοπιστία της ομάδας υποστήριξής μας. Τελικά, αυτό εξορθολογίζει τη διαδικασία, επιτρέποντάς μας να αντιμετωπίζουμε πιο αποτελεσματικά και γρήγορα τις διάφορες προκλήσεις που αντιμετωπίζουν οι πελάτες μας.",

    "Initial Support and Collaborative Evolution": "Αρχική Υποστήριξη και Συνεργατική Εξέλιξη",
    "At the start of this project, we had to first assess the platform to identify the features that needed improvement. We realized that the existing features, while functional, required enhancements to provide their users with a seamless experience. Vehya faced challenges that are typical for companies on the brink of greatness – challenges that we were excited to tackle head-on. Our main goal was to improve the identified features to ensure optimal performance and user satisfaction. ": "Στην αρχή αυτού του έργου, έπρεπε πρώτα να αξιολογήσουμε την πλατφόρμα για να εντοπίσουμε τα χαρακτηριστικά που χρειάζονταν βελτίωση. Συνειδητοποιήσαμε ότι οι υπάρχουσες λειτουργίες, αν και λειτουργικές, απαιτούσαν βελτιώσεις για να παρέχουν στους χρήστες τους μια απρόσκοπτη εμπειρία. Η Vehya αντιμετώπισε προκλήσεις που είναι χαρακτηριστικές για εταιρείες που βρίσκονται στο χείλος του μεγαλείου – προκλήσεις που ήμασταν ενθουσιασμένοι να αντιμετωπίσουμε κατά μέτωπο. Ο κύριος στόχος μας ήταν να βελτιώσουμε τα χαρακτηριστικά που προσδιορίστηκαν για να εξασφαλίσουμε τη βέλτιστη απόδοση και την ικανοποίηση των χρηστών.",
    "Transition to Manager Service Provider Plan": "Μετάβαση στο Σχέδιο Παρόχου Υπηρεσιών Διευθυντή",
    "Due to the success we had in the first phase of the project, our client (Vehya) recognized our potential and decided to entrust us with an even greater responsibility – the Manager Service Provider Plan. This transition took our partnership to the next level – we were now actively contributing to shaping Vehya's strategic direction. To ensure the partnership was seamless, it was crucial to first align our expertise with their vision to provide the most effective and relevant solutions for their business challenges.  ": "Λόγω της επιτυχίας που είχαμε στην πρώτη φάση του έργου, ο πελάτης μας (Vehya) αναγνώρισε τις δυνατότητές μας και αποφάσισε να μας εμπιστευτεί μια ακόμη μεγαλύτερη ευθύνη – το Σχέδιο Παρόχου Υπηρεσιών Manager. Αυτή η μετάβαση ανέβασε τη συνεργασία μας στο επόμενο επίπεδο – τώρα συμβάλλαμε ενεργά στη διαμόρφωση της στρατηγικής κατεύθυνσης της Vehya. Για να διασφαλίσουμε ότι η συνεργασία ήταν απρόσκοπτη, ήταν σημαντικό να ευθυγραμμίσουμε πρώτα την τεχνογνωσία μας με το όραμά τους για να παρέχουμε τις πιο αποτελεσματικές και σχετικές λύσεις για τις επιχειρηματικές προκλήσεις τους.",
    "Key Initiatives and Innovations": "Βασικές Πρωτοβουλίες και Καινοτομίες",
    "Under the Manager Service Provider Plan, our teams embarked on a series of tasks that aimed at elevating Vehya's services. Some of the key tasks included streamlining the user interface and implementing advanced analytics. Each of these tasks was carefully executed to enrich the user experience and increase operational efficiency.  ": "Σύμφωνα με το Σχέδιο Παρόχου Υπηρεσιών Διευθυντή, οι ομάδες μας ξεκίνησαν μια σειρά εργασιών που στόχευαν στην ανύψωση των υπηρεσιών της Vehya. Ορισμένες από τις βασικές εργασίες περιελάμβαναν τον εξορθολογισμό της διεπαφής χρήστη και την εφαρμογή προηγμένων αναλυτικών στοιχείων. Κάθε μία από αυτές τις εργασίες εκτελέστηκε προσεκτικά για να εμπλουτιστεί η εμπειρία του χρήστη και να αυξηθεί η λειτουργική αποτελεσματικότητα.",
    "Re-Architecting the System for Scalability": "Επαναρχιτεκτονική του Συστήματος για Επεκτασιμότητα",
    "The journey towards success is often accompanied by growth, and for Vehya, this meant addressing the challenge of scalability since its goal is to serve customers globally. We realized that their existing system was robust but needed re-architecting to accommodate the company's expanding user base. ": "Το ταξίδι προς την επιτυχία συχνά συνοδεύεται από ανάπτυξη, και για τη Vehya, αυτό σήμαινε την αντιμετώπιση της πρόκλησης της επεκτασιμότητας, καθώς στόχος της είναι να εξυπηρετεί πελάτες παγκοσμίως. Συνειδητοποιήσαμε ότι το υπάρχον σύστημά τους ήταν στιβαρό, αλλά χρειαζόταν εκ νέου αρχιτεκτονική για να φιλοξενήσει τη διευρυνόμενη βάση χρηστών της εταιρείας.",
    "We worked with their team to redesign and restructure the system, ensuring it could handle increased demand without compromising performance. The goal was to create a more agile and responsive platform capable of handling the demands of Vehya's growing global presence, which we achieved. ": "Συνεργαστήκαμε με την ομάδα τους για τον επανασχεδιασμό και την αναδιάρθρωση του συστήματος, διασφαλίζοντας ότι θα μπορούσε να χειριστεί την αυξημένη ζήτηση χωρίς να θέτει σε κίνδυνο την απόδοση. Ο στόχος ήταν να δημιουργήσουμε μια πιο ευέλικτη και ανταποκρινόμενη πλατφόρμα ικανή να χειριστεί τις απαιτήσεις της αυξανόμενης παγκόσμιας παρουσίας της Vehya, την οποία πετύχαμε.",
    "Expansion into Global Company Compliance Regulations": "Επέκταση στους Παγκόσμιους Κανονισμούς Συμμόρφωσης Εταιρειών",
    "Since Vehya’s goal was to serve customers globally, they needed to comply with international regulations. As the IT service provider, it was our role to help Vehya navigate the complex landscape of global compliance standards. This task involved paying attention to detail, ensuring that Vehya's services adhered to diverse regulations while maintaining a consistent user experience.  ": "Δεδομένου ότι ο στόχος της Vehya ήταν να εξυπηρετεί τους πελάτες παγκοσμίως, έπρεπε να συμμορφώνονται με τους διεθνείς κανονισμούς. Ως πάροχος υπηρεσιών πληροφορικής, ο ρόλος μας ήταν να βοηθήσουμε τη Vehya να περιηγηθεί στο περίπλοκο τοπίο των παγκόσμιων προτύπων συμμόρφωσης. Αυτή η εργασία περιελάμβανε την προσοχή στη λεπτομέρεια, διασφαλίζοντας ότι οι υπηρεσίες της Vehya συμμορφώνονταν με διάφορους κανονισμούς διατηρώντας παράλληλα μια συνεπή εμπειρία χρήστη. ",
    "Conclusion": "συμπέρασμα",
    "Overall, the project was a success, and we leave with a sense of pride as an IT company. While collaborating with Vehya, the cohesive synergy of our teams served as the driving force, highlighting the significance of effective communication, mutual respect, and the utilization of strengths. Additionally, we learned valuable lessons from this project, which our team will use to enhance the quality and effectiveness of our future collaborations with Vehya and other clients. ": "Συνολικά, το έργο στέφθηκε με επιτυχία και φεύγουμε με μια αίσθηση υπερηφάνειας ως εταιρεία πληροφορικής. Κατά τη συνεργασία με τη Vehya, η συνεκτική συνέργεια των ομάδων μας λειτούργησε ως κινητήρια δύναμη, αναδεικνύοντας τη σημασία της αποτελεσματικής επικοινωνίας, του αμοιβαίου σεβασμού και της αξιοποίησης των δυνατοτήτων. Επιπλέον, πήραμε πολύτιμα μαθήματα από αυτό το έργο, τα οποία θα χρησιμοποιήσει η ομάδα μας για να βελτιώσει την ποιότητα και την αποτελεσματικότητα των μελλοντικών μας συνεργασιών με την Vehya και άλλους πελάτες.",

    "Understanding the Vision": "Κατανόηση του Οράματος",
    "Before getting into the weeds of the project, the first thing our team needed to do was to understand the vision of our client. This involved having several discussions with the Propsmarts team. As stated earlier, Propsmarts’s vision was to create an all-in-one platform to make it easier for their clients to buy and sell real estate properties like land. We had several brainstorming sessions with the Propsmarts team to gather requirements and ensure we had all requirements before getting started with the project.  ": "Πριν μπούμε στα ζιζάνια του έργου, το πρώτο πράγμα που έπρεπε να κάνει η ομάδα μας ήταν να κατανοήσει το όραμα του πελάτη μας. Αυτό περιλάμβανε αρκετές συζητήσεις με την ομάδα της Propsmarts. Όπως αναφέρθηκε προηγουμένως, το όραμα της Propsmarts ήταν να δημιουργήσει μια πλατφόρμα all-in-one για να διευκολύνει τους πελάτες τους να αγοράσουν και να πουλήσουν ακίνητα όπως γη. Είχαμε αρκετές συνεδρίες καταιγισμού ιδεών με την ομάδα της Propsmarts για να συγκεντρώσουμε τις απαιτήσεις και να διασφαλίσουμε ότι είχαμε όλες τις απαιτήσεις πριν ξεκινήσουμε το έργο.",
    "Market Research and Analysis": "Έρευνα και Ανάλυση Αγοράς",
    "In order to create a product with a competitive edge, differentiation is key. That’s why we had to do thorough market research and analysis to create a product with unique features and capabilities to already existing products. However, we also had to ensure Propsmarts had all the core capabilities that its competitors offered. This phase of the project served as the compass guiding the product's development. ": "Προκειμένου να δημιουργηθεί ένα προϊόν με ανταγωνιστικό πλεονέκτημα, η διαφοροποίηση είναι το κλειδί. Γι' αυτό έπρεπε να κάνουμε ενδελεχή έρευνα αγοράς και ανάλυση για να δημιουργήσουμε ένα προϊόν με μοναδικά χαρακτηριστικά και δυνατότητες σε ήδη υπάρχοντα προϊόντα. Ωστόσο, έπρεπε επίσης να διασφαλίσουμε ότι η Propsmarts είχε όλες τις βασικές δυνατότητες που πρόσφεραν οι ανταγωνιστές της. Αυτή η φάση του έργου χρησίμευσε ως η πυξίδα που καθοδηγούσε την ανάπτυξη του προϊόντος.",
    "Conceptualization and Design": "Εννοιολόγηση και Σχεδιασμός",
    "Following the market analysis, our next step was to interpret the collected data and align it with the client's specifications. This allowed us to formulate a concept design for the project. Throughout this process, we maintained close collaboration with the client to ensure that the design matched their expectations. Additionally, we ensured the seamless integration of all the envisioned features and functionalities that Propsmarts was set to offer within this concept design. ": "Μετά την ανάλυση της αγοράς, το επόμενο βήμα μας ήταν να ερμηνεύσουμε τα δεδομένα που συλλέχθηκαν και να τα ευθυγραμμίσουμε με τις προδιαγραφές του πελάτη. Αυτό μας επέτρεψε να διαμορφώσουμε ένα σχέδιο ιδέας για το έργο. Καθ' όλη τη διάρκεια αυτής της διαδικασίας, διατηρήσαμε στενή συνεργασία με τον πελάτη για να διασφαλίσουμε ότι ο σχεδιασμός ανταποκρίνεται στις προσδοκίες του. Επιπλέον, διασφαλίσαμε την απρόσκοπτη ενσωμάτωση όλων των οραματιζόμενων χαρακτηριστικών και λειτουργιών που η Propsmarts επρόκειτο να προσφέρει σε αυτό το concept design.",
    "Development and Engineering": "Ανάπτυξη και Μηχανική",
    "After the client approved the concept, it was time to get our hands dirty. The development process involved creating a robust backend infrastructure capable of handling data processing, analysis, and user interactions. We also had to create the user interface (front-end) of the platform and ensure it offers a seamless user experience, emphasizing usability and responsiveness. ": "Αφού ο πελάτης ενέκρινε την ιδέα, ήρθε η ώρα να λερώσουμε τα χέρια μας. Η διαδικασία ανάπτυξης περιλάμβανε τη δημιουργία μιας ισχυρής υποδομής υποστήριξης ικανή να χειρίζεται την επεξεργασία δεδομένων, την ανάλυση και τις αλληλεπιδράσεις των χρηστών. Έπρεπε επίσης να δημιουργήσουμε τη διεπαφή χρήστη (front-end) της πλατφόρμας και να διασφαλίσουμε ότι προσφέρει μια απρόσκοπτη εμπειρία χρήστη, δίνοντας έμφαση στη χρηστικότητα και την ανταπόκριση.",
    "Data Integration and Analysis": "Ενοποίηση και Ανάλυση Δεδομένων",
    "When it comes to any property investment platform, the accessibility and integrity of data is crucial. With Propsmarts, we had to integrate several data sources to provide users with comprehensive property information, allowing them to make informed decisions. This involved creating algorithms to perform tasks such as property valuation, market trend analysis, and investment projections. ": "Όταν πρόκειται για οποιαδήποτε πλατφόρμα επενδύσεων σε ακίνητα, η προσβασιμότητα και η ακεραιότητα των δεδομένων είναι ζωτικής σημασίας. Με το Propsmarts, έπρεπε να ενσωματώσουμε πολλές πηγές δεδομένων για να παρέχουμε στους χρήστες ολοκληρωμένες πληροφορίες ιδιοκτησίας, επιτρέποντάς τους να λαμβάνουν τεκμηριωμένες αποφάσεις. Αυτό περιλάμβανε τη δημιουργία αλγορίθμων για την εκτέλεση εργασιών όπως η αποτίμηση ακινήτων, η ανάλυση τάσεων της αγοράς και οι επενδυτικές προβλέψεις.",
    "Testing and fine-tuning the product": "Δοκιμή και τελειοποίηση του προϊόντος",
    "After building the product, it is crucial to ensure it works as intended; that’s why testing and fine-tuning were crucial. We did this through rigorous usability testing involving diverse potential users. We then used this feedback to fine-tune the user experience of the products by identifying and addressing performance bottlenecks and optimizing for speed and efficiency. ": "Μετά την κατασκευή του προϊόντος, είναι σημαντικό να διασφαλιστεί ότι λειτουργεί όπως προβλέπεται. γι' αυτό οι δοκιμές και η τελειοποίηση ήταν ζωτικής σημασίας. Το κάναμε αυτό μέσω αυστηρών δοκιμών χρηστικότητας που περιλάμβαναν διάφορους πιθανούς χρήστες. Στη συνέχεια, χρησιμοποιήσαμε αυτά τα σχόλια για να βελτιώσουμε την εμπειρία χρήστη των προϊόντων εντοπίζοντας και αντιμετωπίζοντας τα σημεία συμφόρησης απόδοσης και βελτιστοποιώντας την ταχύτητα και την αποτελεσματικότητα.",
    "The creation of Propsmarts encompassed multiple processes, as detailed in this article. Throughout each stage, our team collaborated with the client to ensure we were on the right track regarding their requirements. Ultimately, the client loved the outcome, and our team also learned valuable lessons that we aim to incorporate into our future projects. We are grateful to Propsmarts for trusting us with this project. ": "Η δημιουργία του Propsmarts περιελάμβανε πολλαπλές διαδικασίες, όπως περιγράφεται λεπτομερώς σε αυτό το άρθρο. Σε κάθε στάδιο, η ομάδα μας συνεργάστηκε με τον πελάτη για να διασφαλίσει ότι βρισκόμαστε στο σωστό δρόμο όσον αφορά τις απαιτήσεις του. Τελικά, ο πελάτης αγάπησε το αποτέλεσμα και η ομάδα μας πήρε επίσης πολύτιμα μαθήματα που στοχεύουμε να ενσωματώσουμε στα μελλοντικά μας έργα. Είμαστε ευγνώμονες στην Propsmarts που μας εμπιστεύτηκε αυτό το έργο. ",
    "Request a call": "Ζητήστε μια κλήση",
    "Fill out the form below and receive our free consultation": "Συμπληρώστε την παρακάτω φόρμα και λάβετε τη δωρεάν συμβουλευτική μας",
    "Sales": "Εκπτώσεις",
    "Name": "Ονομα *",
    "Email address": "Διεύθυνση ηλεκτρονικού ταχυδρομείου *",
    "Phone number": "Τηλεφωνικό νούμερο *",
    "Company Name": "Όνομα εταιρείας *",
    "Some field is missing.": "Λείπει κάποιο πεδίο.",
    "Submit Request": "Υποβολή Αίτησης",
    "Your message has been sent!": "Το μήνυμα σας εστάλει!",
    "Interest": "Ενδιαφέρον",
    "Thank you for sending us a message. One of our experts touch in the next 24-48 hours!": "Σας ευχαριστούμε που μας στείλατε ένα μήνυμα. Ένας από τους ειδικούς μας αγγίζει τις επόμενες 24-48 ώρες!",

    "Email field is required.": "Το πεδίο του email είναι υποχρεωτικό.",
    "Invalid email format.": "Μη έγκυρη μορφή email.",
    "Name field is required.": "Το πεδίο ονόματος είναι υποχρεωτικό.",
    "Interest field is required.": "Απαιτείται πεδίο ενδιαφέροντος.",
    "Company Name field is required.": "Απαιτείται το πεδίο επωνυμίας εταιρείας.",
    "PhoneNumber field is required.": "Το πεδίο PhoneNumber είναι υποχρεωτικό.",
    "Invalid phone number format.": "Μη έγκυρη μορφή αριθμού τηλεφώνου.",

    "25 July 2023": "25 Ιούλιος 2023",
    "30 June 2023": "30 Ιούνιος 2023",
    "30 April 2023": "30 Απρίλιος 2023"

}