{
    "navLinks.home": "Lar",
    "navLinks.work": "Nosso trabalho",
    "navLinks.careers": "Carreiras",
    "navLinks.contact": "Contate-nos",
    "contact us": "Contate-nos",
    "Use technology to your advantage": "Use a tecnologia a seu favor",
    "Experience our unwavering commitment to delivering exceptional IT solutions with integrity and transparency": "Experimente nosso compromisso inabalável em fornecer soluções excepcionais de TI com integridade e transparência",
    "Book Free Consultation": "Marcar Consulta Gratuita",
    "About Us": "Sobre nós",
    "As the world evolves and technological advances increase, businesses face the challenge of keeping processes and systems up to date, replacing legacy systems with newer tech. Companies worldwide rely on emerging technologies to drive strategy and growth, giving them a competitive edge.": "À medida que o mundo evolui e os avanços tecnológicos aumentam, as empresas enfrentam o desafio de manter processos e sistemas atualizados, substituindo sistemas legados por tecnologias mais recentes. Empresas em todo o mundo dependem de tecnologias emergentes para impulsionar a estratégia e o crescimento, dando-lhes uma vantagem competitiva.",
    "At March, we help companies incorporate the latest technologies into their business models and provide a seamless experience to customers while building strategic models that define the best ways to sell, upsell, and cross-sell products.": "Em março, ajudamos as empresas a incorporar as tecnologias mais recentes em seus modelos de negócios e fornecer uma experiência perfeita aos clientes, criando modelos estratégicos que definem as melhores maneiras de vender, fazer upsell e cross-sell de produtos.",
    "Our Vision": "Nossa visão",
    "At Marchcroft, we solve  business problems with technology. Whether that is building a new product, improving existing processes or helping companies become digitally connected. We focus on creating economic growth through strategic assessment of our client needs, providing operational support, ensuring operational excellence and guaranteeing the security of confidential information and trade advantages.": "Na Marchcroft, resolvemos problemas de negócios com tecnologia. Seja construindo um novo produto, melhorando processos existentes ou ajudando empresas a se conectarem digitalmente. Nosso foco é criar crescimento econômico por meio da avaliação estratégica das necessidades de nossos clientes, fornecendo suporte operacional, garantindo excelência operacional e garantindo a segurança de informações confidenciais e vantagens comerciais.",
    "Our Solutions": "Nossas Soluções",
    "Introducing our Comprehensive Solutions Suite": "Apresentando nosso pacote de soluções abrangentes",
    "Increase Delivery Times": "Aumente os tempos de entrega",
    "Utilizing technology-driven solutions to expedite delivery processes, enabling swift and efficient product or service distribution": "Utilizando soluções baseadas em tecnologia para agilizar os processos de entrega, permitindo uma distribuição rápida e eficiente de produtos ou serviços",
    "Greenfield Projects": "Projetos Greenfield",
    "Leveraging technology to pioneer new ventures, ignite innovation, and embark on fresh and transformative business endeavors": "Aproveitando a tecnologia para abrir novos empreendimentos, estimular a inovação e embarcar em empreendimentos comerciais novos e transformadores",
    "Performance & Cost": "Desempenho e custo",
    "Harnessing technology to enhance business efficiency, streamline processes, and reduce costs, driving optimal performance": "Aproveitando a tecnologia para aumentar a eficiência dos negócios, agilizar processos e reduzir custos, impulsionando o desempenho ideal",
    "Scalable Products": "Produtos escaláveis",
    "Leveraging technology’s scalability to create adaptable and flexible products, ensuring seamless growth and future-proofing businesses": "Aproveitando a escalabilidade da tecnologia para criar produtos adaptáveis e flexíveis, garantindo um crescimento contínuo e empresas preparadas para o futuro",
    "Eco-Friendly Solutions": "Soluções ecológicas",
    "Utilizing technology to enhance interactions, personalize offerings, and create memorable customer journeys, elevating satisfaction levels": "Utilizando a tecnologia para aprimorar interações, personalizar ofertas e criar jornadas memoráveis para o cliente, elevando os níveis de satisfação",
    "Increase ROI": "Aumentar o ROI",
    "Harness tech to develop environmentally conscious and sustainable solutions, fostering greener approach to business practices": "Aproveite a tecnologia para desenvolver soluções ambientalmente conscientes e sustentáveis, promovendo uma abordagem mais ecológica às práticas de negócios",
    "Services We Offer": "Serviços que oferecemos",
    "A quick intro of the services we offer at Marchcroft": "Uma rápida introdução aos serviços que oferecemos na Marchcroft",
    "Strategic Consultancy": "Consultoria Estratégica",
    "Our dependable client teams pinpoint problem areas and recommend services or goods that can help with business requirements. We focus on discovering customer value and increasing interest return on digital solutions. Based on market-leading frameworks, we customise solutions to fit unique customer demands.Our dependable client teams pinpoint problem areas and recommend services or goods that can help with business requirements. We focus on discovering customer value and increasing interest return on digital solutions. Based on market-leading frameworks, we customise solutions to fit unique customer demands.": "Nuestros equipos de clientes confiables identifican áreas problemáticas y recomiendan servicios o productos que pueden ayudar con los requisitos comerciales. Nos enfocamos en descubrir el valor del cliente y aumentar el retorno de interés en las soluciones digitales. Basados en marcos líderes en el mercado, personalizamos soluciones para satisfacer las demandas únicas de los clientes. Nuestros equipos de clientes confiables identifican áreas problemáticas y recomiendan servicios o productos que pueden ayudar con los requisitos comerciales. Nos enfocamos en descubrir el valor del cliente y aumentar el retorno de interés en las soluciones digitales. Basados en marcos líderes en el mercado, personalizamos soluciones para satisfacer las demandas únicas de los clientes.",
    "Software Architecture & Infrastructure": "Arquitetura e infraestrutura de software",
    "Enhancing and implementing key software elements that support business operations, finance, and security within the organisation. We focus on speeding up the digital transformation process, mitigating risk, scaling quickly, and bringing business and IT together.": "Aprimorar e implementar os principais elementos de software que suportam as operações de negócios, finanças e segurança dentro da organização. Nosso foco é acelerar o processo de transformação digital, mitigar riscos, escalar rapidamente e unir negócios e TI.",
    "Digital Transformation": "Transformação digital",
    "We help our clients to be more digitally connected, accelerate the delivery of products and increase the return on interest. Our approach is to employ agile culture and mindset, building cross-functional teams and guaranteeing success through data metrics.": "Ayudamos a nuestros clientes a estar más conectados digitalmente, acelerar la entrega de productos y aumentar la rentabilidad de los intereses. Nuestro enfoque es emplear una mentalidad y una cultura ágiles, crear equipos multifuncionales y garantizar el éxito a través de métricas de datos.",
    "Engineering and Technology": "Engenharia e Tecnologia",
    "Utilise cutting-edge technologies to give the business a competitive edge. We help our clients to ensure they are keeping up to date with tech. Better performing system, insights to data and securing of assets and competitive advantages.": "Utilizar tecnologias de ponta para dar ao negócio uma vantagem competitiva. Ajudamos nossos clientes a garantir que eles estejam atualizados com a tecnologia. Sistema com melhor desempenho, insights para dados e proteção de ativos e vantagens competitivas.",
    "UX Design": "Design UX",
    "To create the best User Experience (UX) strategy, it is essential to match your business goals with your clients. Our team conducts research to develop a tailored and cohesive experience that is aligned with your overall brand stance. Our team thoroughly tests with users at each step of the process for product success. Company reputation is our aim, focusing on what matters to customers and providing our clients with a competitive advantage.": "Para criar a melhor estratégia de experiência do usuário (UX), é essencial combinar seus objetivos de negócios com seus clientes. Nossa equipe realiza pesquisas para desenvolver uma experiência personalizada e coesa que esteja alinhada com a postura geral da sua marca. Nossa equipe testa minuciosamente com os usuários em cada etapa do processo para o sucesso do produto. A reputação da empresa é o nosso objetivo, focando no que é importante para os clientes e proporcionando aos nossos clientes uma vantagem competitiva.",
    "Cloud": "Nuvem",
    "Building resilience in software architecture can be achieved through cloud technology. Our teams focus on building organisational agility, implementing delivery pipelines and high service availability, therefore driving growth.": "A construção de resiliência na arquitetura de software pode ser alcançada por meio da tecnologia de nuvem. Nossas equipes se concentram em criar agilidade organizacional, implementando pipelines de entrega e alta disponibilidade de serviços, impulsionando o crescimento.",
    "How We Work": "Como trabalhamos",
    "A deep dive on how we work with our clients and our work process": "Um mergulho profundo em como trabalhamos com nossos clientes e nosso processo de trabalho",
    "Understand your problems": "Entenda seus problemas",
    "Our experts will develop a strategic solution, including architecture designs and mockup": "Nossos especialistas desenvolverão uma solução estratégica, incluindo projetos de arquitetura e maquete",
    "Agile Work Cycle": "Ciclo de trabalho ágil",
    "Your product is being worked on. get frequent updates during the delivery cycle": "Seu produto está sendo trabalhado. obtenha atualizações frequentes durante o ciclo de entrega",
    "Go live": "Ir ao vivo",
    "We will be there to support you even after completion day": "Estaremos lá para apoiá-lo mesmo após o dia da conclusão",
    "Success": "Sucesso",
    "We make sure your product is top-notch and drive revenue": "Garantimos que seu produto seja de primeira linha e gere receita",
    "Our Technology Stack": "Nossa pilha de tecnologia",
    "Our tech stack drives digital transformation, empowering businesses wth cutting-edge tools and platforms. From robust backends to seamless user experience, we deliver scalable, secure, and efficient solutions": "Nossa pilha de tecnologia impulsiona a transformação digital, capacitando as empresas com ferramentas e plataformas de ponta. De back-ends robustos a uma experiência de usuário perfeita, oferecemos soluções escaláveis, seguras e eficientes",
    "Our Work": "Nosso trabalho",
    "See what our customers have to say about working with us": "Veja o que nossos clientes têm a dizer sobre trabalhar conosco",
    "I’ve been using Marchcroft for two months now. Aside their exceptional   business services their customer services is peak and lovely! Looking forward to get more things done with the wonderful team": "Estou usando Marchcroft há dois meses. Além de seus serviços comerciais excepcionais, seu atendimento ao cliente é excelente e adorável! Ansioso para fazer mais coisas com a equipe maravilhosa",
    "- P Williams, Securely": "- P Williams, com segurança",
    "I'm highly impressed with Marchcroft consulting. Their expertise, clear communication, and efficient implementation resulted in a solution that exceeded our expectations. They're a top-notch partner for software consulting.": "Estou muito impressionado com a consultoria da Marchcroft. Sua experiência, comunicação clara e implementação eficiente resultaram em uma solução que superou nossas expectativas. Eles são um parceiro de primeira linha para consultoria de software.",
    "- James Hardy, Coinclustr": "- James Hardy, Coinclustr",
    " A valuable partner that consistently goes above and beyond.": "Um parceiro valioso que consistentemente vai além.",
    "- Marc Consulting": "- Marc Consultoria",
    "Talk to Us": "Fale Conosco",
    "Get in touch to discuss your digital ambitions. We can help you achieve them": "Entre em contato para discutir suas ambições digitais. Nós podemos ajudá-lo a alcançá-los",
    "Compliance services": "serviços de conformidade",
    "Privacy": "Privacidade",
    "Terms of service": "Termos de serviço",
    "Get In Touch": "Entrar em contato",
    "Recent blog posts": "Postagens de blog recentes",
    "Load More": "Carregue mais",
    "Read more": "Consulte Mais informação",
    "How We Use Artificial Intelligence to Improve Customer Service": "Como usamos a inteligência artificial para melhorar o atendimento ao cliente",
    "Artificial intelligence (AI) is one of the revolutionary technologies that has had an impact on several industries in the last few years. As an IT company, we have integrated AI into many of our workflows to streamline operations and enhance our effectiveness and productivity. To help you understand how we leverage the power of AI, this article will explore some of the ways we use it to enhance customer service. ": "A inteligência artificial (IA) é uma das tecnologias revolucionárias que teve impacto em diversas indústrias nos últimos anos. Como uma empresa de TI, integramos a IA em muitos de nossos fluxos de trabalho para simplificar as operações e aprimorar nossa eficácia e produtividade. Para ajudá-lo a entender como aproveitamos o poder da IA, este artigo explorará algumas das maneiras como a usamos para aprimorar o atendimento ao cliente.",
    "Work we have done for Vehya": "Trabalho que fizemos para Vehya",
    "At Marchcroft, our vision is to utilize cutting-edge technologies to assist businesses in streamlining their operations, thereby enhancing efficiency and productivity. In one of our recent projects, we collaborated with Vehya, a marketplace for electrification products, to enhance various existing features on their platform.  This article aims to provide you with comprehensive insights into this project, including the various tasks we handled during this project. Without further ado, let's delve in right away!": "Na Marchcroft, nossa visão é utilizar tecnologias de ponta para ajudar as empresas a simplificar suas operações, aumentando assim a eficiência e a produtividade. Em um de nossos projetos recentes, colaboramos com a Vehya, um mercado de produtos de eletrificação, para aprimorar vários recursos existentes em sua plataforma. Este artigo tem como objetivo fornecer informações abrangentes sobre este projeto, incluindo as várias tarefas que realizamos durante este projeto. Sem mais delongas, vamos nos aprofundar imediatamente!",
    "Creating a Property Investment Tool from Scratch": "Criando uma ferramenta de investimento imobiliário do zero",
    "At Marchcroft, we develop products for businesses in various industries, including Fintech. With this project, we were tasked with developing Propsmarts – a comprehensive property investment tool that allows users to buy or sell real estate properties, such as land, all on one platform. In this article, we will walk you through the process we went through while handling this project. Let’s dive right in! ": "Na Marchcroft, desenvolvemos produtos para empresas de vários setores, incluindo Fintech. Com este projeto, fomos encarregados de desenvolver o Propsmarts – uma ferramenta abrangente de investimento imobiliário que permite aos usuários comprar ou vender imóveis, como terrenos, tudo em uma plataforma. Neste artigo, mostraremos o processo pelo qual passamos ao lidar com este projeto. Vamos mergulhar de cabeça!",
    "Open roles": "funções abertas",
    "Competencies": "Competências",
    "Experience required": "Experiência exigida",
    "Location": "Localização",
    "Careers": "Carreiras",


    "Senior Full Stack Software Engineer": "Engenheiro de Software Full Stack Sênior",
    "Are you a passionate Senior Full Stack Engineer seeking a new opportunity to work on innovative projects? Join our team and make an impact on cutting-edge technologies!": "Você é um apaixonado Senior Full Stack Engineer procurando uma nova oportunidade para trabalhar em projetos inovadores? Junte-se à nossa equipe e cause impacto em tecnologias de ponta!",
    "Competitive £/hr": "Competitivo £/h",
    "We are looking for an enthusiastic and inquisitive individual who can think creatively to solve problems and meet user requirements. You must have a keen interest in software requirements and have a keen interest in sofware engineering and be ready to research and learn new techniques, languages and frameworks. Working with a DevSecOps mindset, you will be developing, delivering and operating applications using a secure approach.": "Estamos à procura de um indivíduo entusiasmado e curioso que possa pensar criativamente para resolver problemas e atender aos requisitos do usuário. Você deve ter um grande interesse em requisitos de software e ter um grande interesse em engenharia de software e estar pronto para pesquisar e aprender novas técnicas, linguagens e estruturas. Trabalhando com uma mentalidade de DevSecOps, você desenvolverá, fornecerá e operará aplicativos usando uma abordagem segura.We are looking for an enthusiastic and inquisitive individual who can think creatively to solve problems and meet user requirements. You must have a keen interest in software requirements and have a keen interest in sofware engineering and be ready to research and learn new techniques, languages and frameworks. Working with a DevSecOps mindset, you will be developing, delivering and operating applications using a secure approach.",
    "Contributing to the development and refinement of user requirements.": "Contribuir para o desenvolvimento e refinamento dos requisitos do usuário.",
    "Actively contribute to Scrum ceremonies such as Refinement, Sprint Planning and Retrospective.": "Contribua ativamente para as cerimônias do Scrum, como Refinamento, Planejamento do Sprint e Retrospectiva.",
    "Designing innovative solutions to solve problems and meet requirements.": "Desenhar soluções inovadoras para resolver problemas e cumprir requisitos.",
    "Elaborate solutions at a high level and create low level designs that conforms to set standards.": "Elabore soluções de alto nível e crie projetos de baixo nível que estejam em conformidade com os padrões estabelecidos.",
    "Communicate effectively to a variety of audiences including both technical and non-technical stakeholders.": "Comunique-se efetivamente com uma variedade de públicos, incluindo partes interessadas técnicas e não técnicas.",
    "Leading Demo Sessions as part of sprint reviews.": "Liderando Sessões de Demonstração como parte das revisões de sprint.",
    "Implementing solutions using a variety of programming languages, frameworks, tools and techniques.": "Implementando soluções usando uma variedade de linguagens de programação, frameworks, ferramentas e técnicas.",
    "Encourage and practice TDD and other Delivery Best practices.": "Incentivar e praticar TDD e outras práticas recomendadas de entrega.",
    "Producing applicable technical documentation.": "Produção de documentação técnica aplicável.",
    "Contribute to improvements of our technical excellence and ways of working within Squad, Chapter and Guild forums.": "Contribuir para melhorias de nossa excelência técnica e formas de trabalhar nos fóruns Squad, Chapter e Guild.",
    "Actively Contribute to and progress the technical roadmap.": "Contribuir ativamente e progredir no roteiro técnico.",
    "Mentoring Software Engineers, Graduate and Junior population.": "Mentoria de engenheiros de software, população de graduados e juniores.",
    "Address Technical Debt and consistently recommend Continuous Improvement initiatives.": "Resolva a Dívida Técnica e recomende consistentemente iniciativas de Melhoria Contínua.",
    "Competent in DevOps approach and practices.": "Competente em abordagem e práticas de DevOps.",
    "Identification and ownership of NFRs.": "Identificação e propriedade de NFRs.",
    "Actively encourage and provide knowledge transfer during the delivery stride.": "Encoraje e forneça ativamente a transferência de conhecimento durante o passo de entrega.",

    "Experience developing, implementing, and maintaining applications written in either of Java, Kotlin or Python.": "Experiência no desenvolvimento, implementação e manutenção de aplicativos escritos em Java, Kotlin ou Python.",
    "Web services development experience using spring boot or similar.":"Experiência em desenvolvimento de serviços web utilizando spring boot ou similar.",
    "Web development experience using HTML, CSS and a JavaScript/TypeScript framework, preferably Angular 2+.": "Experiência em desenvolvimento web usando HTML, CSS e um framework JavaScript/TypeScript, preferencialmente Angular 2+.",
    "Experience with SQL and relational database technologies such as PostgreSQL, MySQL or MS SQL.": "Experiência com SQL e tecnologias de banco de dados relacionais, como PostgreSQL, MySQL ou MS SQL.",
    "Experience with development tools such as Git, Maven, npm etc." : "Experiência com ferramentas de desenvolvimento como Git, Maven, npm etc.",
    "Experience with Cloud technologies (Google Cloud Platform preferred but others would be considered).": "Experiência com tecnologias de nuvem (preferencialmente Google Cloud Platform, mas outras seriam consideradas).",
    "Experience with CI/CD pipelines, ideally Azure DevOps.": "Experiência com pipelines CI/CD, preferencialmente Azure DevOps.",
    "Experience with Service Mesh Technologies preferably Istio or Anthos": "Experiência com Service Mesh Technologies preferencialmente Istio ou Anthos",
    "Experience with Docker, Kubernetes, Helm, or Terraform.": "Experiência com Docker, Kubernetes, Helm ou Terraform.",
    "Experience with BigQuery is an added advantage.": "Experiência com BigQuery é uma vantagem adicional.",
    "A good mix of the competencies mentioned above is required for the candidate to be successful within a squad in Data Tribe. The squad will contain engineers with similar profile with various areas of expertise. The senior is expected to make use of these expertise areas to arrive at a solution that can be built, delivered and operated in a productionized environment.": "Uma boa combinação das competências mencionadas acima é necessária para que o candidato seja bem-sucedido em um esquadrão da Data Tribe. O plantel contará com engenheiros de perfil semelhante em diversas áreas de atuação. Espera-se que o sênior faça uso dessas áreas de especialização para chegar a uma solução que possa ser construída, entregue e operada em um ambiente de produção.",
    "This role can be offered on a hybrid or fully remote working basis.": "Essa função pode ser oferecida em regime de trabalho híbrido ou totalmente remoto.",

    "More advanced chatbot-based support": "Suporte mais avançado baseado em chatbot",
    "Recent advancements in AI technology have greatly improved the effectiveness of chatbots for customer support. With enhanced natural language processing, chatbots can now provide accurate and reliable solutions to a wide range of customer questions. This has made customers more comfortable interacting with chatbots, as they can expect precise solutions to their problems. As a result, chatbots can now handle simple and common inquiries, allowing human support agents to focus on more complex tasks. ": "Avanços recentes na tecnologia de IA melhoraram muito a eficácia dos chatbots para suporte ao cliente. Com processamento aprimorado de linguagem natural, os chatbots agora podem fornecer soluções precisas e confiáveis para uma ampla gama de perguntas dos clientes. Isso deixou os clientes mais à vontade para interagir com os chatbots, pois eles podem esperar soluções precisas para seus problemas. Como resultado, os chatbots agora podem lidar com consultas simples e comuns, permitindo que os agentes de suporte humano se concentrem em tarefas mais complexas. ",
    "Personalized Interactions": "Interações personalizadas",
    "By using AI algorithms, it is now much easier for us to analyze a customer's historical data and behavior to gain insights into their preferences, purchase history, and past interactions with our company. Armed with this information, our teams can easily provide recommendations, offers, and solutions that are relevant to the customer. This level of personalization not only enhances customer engagement but also makes customers feel valued and understood by our company. ": "Ao usar algoritmos de IA, agora é muito mais fácil analisar os dados históricos e o comportamento de um cliente para obter informações sobre suas preferências, histórico de compras e interações anteriores com nossa empresa. De posse dessas informações, nossas equipes podem facilmente fornecer recomendações, ofertas e soluções relevantes para o cliente. Esse nível de personalização não apenas aumenta o envolvimento do cliente, mas também faz com que os clientes se sintam valorizados e compreendidos por nossa empresa. ",
    "Predictive Analytics": "Análise preditiva",
    "Making future predictions has become much easier than ever, thanks to advancements in AI and data analytics. Leveraging AI-driven predictive analytics, which involves using historical customer data and patterns to anticipate future needs and behaviors enables us to offer solutions or assistance ahead of time. For instance, our systems can predict customers' needs based on their previous interactions and automatically recommend one of our services to them. ": "Fazer previsões futuras tornou-se muito mais fácil do que nunca, graças aos avanços em IA e análise de dados. Aproveitar a análise preditiva orientada por IA, que envolve o uso de dados e padrões históricos do cliente para antecipar necessidades e comportamentos futuros, nos permite oferecer soluções ou assistência com antecedência. Por exemplo, nossos sistemas podem prever as necessidades dos clientes com base em suas interações anteriores e recomendar automaticamente um de nossos serviços a eles. ",
    "Data-Driven decision": "Decisão baseada em dados",
    "Effective decision-making can significantly influence a company's service delivery. Through the utilization of AI analytics on customer data, we can extract valuable insights about trends, preferences, and areas of concern. These insights empower our team to make well-informed decisions to enhance our customers' experience. ": "A tomada de decisão eficaz pode influenciar significativamente a prestação de serviços de uma empresa. Por meio da utilização de análises de IA nos dados do cliente, podemos extrair informações valiosas sobre tendências, preferências e áreas de interesse. Esses insights capacitam nossa equipe a tomar decisões bem informadas para aprimorar a experiência de nossos clientes. ",
    "For instance, our systems can analyze data about project delivery times, pinpointing gaps in our service provision. This helps in making the right choice when determining how we can improve the way we deal with client projects.": "Por exemplo, nossos sistemas podem analisar dados sobre prazos de entrega de projetos, identificando lacunas em nossa prestação de serviços. Isso ajuda a fazer a escolha certa ao determinar como podemos melhorar a maneira como lidamos com os projetos dos clientes.",
    "Self-Service Portals": "Portais de Autoatendimento",
    "To further enhance our customer support reliability, we use an AI-powered self-service portal. This portal allows customers to access information, troubleshoot problems, and find solutions independently without needing direct interaction with a support agent. Ultimately, this allows customers to find solutions on their own terms and also frees up our support team to focus on more complex inquiries. ": "Para aumentar ainda mais a confiabilidade do suporte ao cliente, usamos um portal de autoatendimento com tecnologia de IA. Este portal permite que os clientes acessem informações, solucionem problemas e encontrem soluções de forma independente, sem a necessidade de interação direta com um agente de suporte. Em última análise, isso permite que os clientes encontrem soluções em seus próprios termos e também libera nossa equipe de suporte para se concentrar em consultas mais complexas. ",
    "Final thought": "Pensamento final",
    "In summary, the integration of AI into our operations has proven to be immensely crucial in enhancing our customer service effectiveness. AI can automate tasks, aid in extensive data analysis, and enhance the reliability of our support team. Ultimately, this streamlines the process, allowing us to more efficiently and rapidly address the various challenges encountered by our customers. ": "Em resumo, a integração da IA em nossas operações provou ser extremamente crucial para melhorar a eficácia de nosso atendimento ao cliente. A IA pode automatizar tarefas, auxiliar na extensa análise de dados e aumentar a confiabilidade de nossa equipe de suporte. Em última análise, isso agiliza o processo, permitindo-nos abordar com mais eficiência e rapidez os vários desafios encontrados por nossos clientes.",

    "Initial Support and Collaborative Evolution": "Suporte Inicial e Evolução Colaborativa",
    "At the start of this project, we had to first assess the platform to identify the features that needed improvement. We realized that the existing features, while functional, required enhancements to provide their users with a seamless experience. Vehya faced challenges that are typical for companies on the brink of greatness – challenges that we were excited to tackle head-on. Our main goal was to improve the identified features to ensure optimal performance and user satisfaction. ": "No início deste projeto, tivemos que primeiro avaliar a plataforma para identificar os recursos que precisavam de melhorias. Percebemos que os recursos existentes, embora funcionais, precisavam de aprimoramentos para fornecer aos usuários uma experiência perfeita. Vehya enfrentou desafios típicos de empresas à beira da grandeza - desafios que estávamos entusiasmados em enfrentar de frente. Nosso principal objetivo foi melhorar os recursos identificados para garantir o desempenho ideal e a satisfação do usuário.",
    "Transition to Manager Service Provider Plan": "Plano de Transição para o Provedor de Serviços do Gerente",
    "Due to the success we had in the first phase of the project, our client (Vehya) recognized our potential and decided to entrust us with an even greater responsibility – the Manager Service Provider Plan. This transition took our partnership to the next level – we were now actively contributing to shaping Vehya's strategic direction. To ensure the partnership was seamless, it was crucial to first align our expertise with their vision to provide the most effective and relevant solutions for their business challenges.  ": "Devido ao sucesso que tivemos na primeira fase do projeto, nosso cliente (Vehya) reconheceu nosso potencial e decidiu nos confiar uma responsabilidade ainda maior – o Plano Gestor Prestador de Serviços. Essa transição levou nossa parceria para o próximo nível – agora estávamos contribuindo ativamente para moldar a direção estratégica da Vehya. Para garantir que a parceria fosse perfeita, era crucial primeiro alinhar nossa experiência com sua visão para fornecer as soluções mais eficazes e relevantes para seus desafios de negócios.",
    "Key Initiatives and Innovations": "Principais Iniciativas e Inovações",
    "Under the Manager Service Provider Plan, our teams embarked on a series of tasks that aimed at elevating Vehya's services. Some of the key tasks included streamlining the user interface and implementing advanced analytics. Each of these tasks was carefully executed to enrich the user experience and increase operational efficiency.  ": "Sob o Plano Manager Service Provider, nossas equipes embarcaram em uma série de tarefas que visavam elevar os serviços da Vehya. Algumas das principais tarefas incluíam simplificar a interface do usuário e implementar análises avançadas. Cada uma dessas tarefas foi cuidadosamente executada para enriquecer a experiência do usuário e aumentar a eficiência operacional. ",
    "Re-Architecting the System for Scalability": "Rearquitetando o sistema para escalabilidade",
    "The journey towards success is often accompanied by growth, and for Vehya, this meant addressing the challenge of scalability since its goal is to serve customers globally. We realized that their existing system was robust but needed re-architecting to accommodate the company's expanding user base. ": "A jornada para o sucesso costuma ser acompanhada de crescimento e, para a Vehya, isso significava enfrentar o desafio da escalabilidade, pois seu objetivo é atender clientes globalmente. Percebemos que o sistema existente era robusto, mas precisava de uma nova arquitetura para acomodar a base de usuários em expansão da empresa.",
    "We worked with their team to redesign and restructure the system, ensuring it could handle increased demand without compromising performance. The goal was to create a more agile and responsive platform capable of handling the demands of Vehya's growing global presence, which we achieved. ": "Trabalhamos com sua equipe para redesenhar e reestruturar o sistema, garantindo que ele pudesse lidar com o aumento da demanda sem comprometer o desempenho. O objetivo era criar uma plataforma mais ágil e responsiva capaz de lidar com as demandas da crescente presença global da Vehya, o que conseguimos.",
    "Expansion into Global Company Compliance Regulations": "Expansão para os regulamentos globais de conformidade da empresa",
    "Since Vehya’s goal was to serve customers globally, they needed to comply with international regulations. As the IT service provider, it was our role to help Vehya navigate the complex landscape of global compliance standards. This task involved paying attention to detail, ensuring that Vehya's services adhered to diverse regulations while maintaining a consistent user experience.  ": "Como o objetivo da Vehya era atender clientes globalmente, eles precisavam cumprir os regulamentos internacionais. Como provedor de serviços de TI, nossa função era ajudar a Vehya a navegar no complexo cenário dos padrões globais de conformidade. Essa tarefa envolvia prestar atenção aos detalhes, garantindo que os serviços da Vehya cumprissem diversos regulamentos, mantendo uma experiência de usuário consistente. ",
    "Conclusion": "Conclusão",
    "Overall, the project was a success, and we leave with a sense of pride as an IT company. While collaborating with Vehya, the cohesive synergy of our teams served as the driving force, highlighting the significance of effective communication, mutual respect, and the utilization of strengths. Additionally, we learned valuable lessons from this project, which our team will use to enhance the quality and effectiveness of our future collaborations with Vehya and other clients. ": "No geral, o projeto foi um sucesso e saímos com orgulho como empresa de TI. Ao colaborar com a Vehya, a sinergia coesa de nossas equipes serviu como força motriz, destacando a importância da comunicação eficaz, respeito mútuo e utilização de pontos fortes. Além disso, aprendemos lições valiosas com este projeto, que nossa equipe usará para aprimorar a qualidade e a eficácia de nossas futuras colaborações com a Vehya e outros clientes. ",

    "Understanding the Vision": "Entendendo a visão",
    "Before getting into the weeds of the project, the first thing our team needed to do was to understand the vision of our client. This involved having several discussions with the Propsmarts team. As stated earlier, Propsmarts’s vision was to create an all-in-one platform to make it easier for their clients to buy and sell real estate properties like land. We had several brainstorming sessions with the Propsmarts team to gather requirements and ensure we had all requirements before getting started with the project.  ": "Antes de entrar no projeto, a primeira coisa que nossa equipe precisava fazer era entender a visão de nosso cliente. Isso envolveu várias discussões com a equipe da Propsmarts. Como afirmado anteriormente, a visão da Propsmarts era criar uma plataforma completa para tornar mais fácil para seus clientes comprar e vender propriedades imobiliárias como terrenos. Tivemos várias sessões de brainstorming com a equipe da Propsmarts para reunir os requisitos e garantir que tínhamos todos os requisitos antes de iniciar o projeto.",
    "Market Research and Analysis": "Pesquisa e análise de mercado",
    "In order to create a product with a competitive edge, differentiation is key. That’s why we had to do thorough market research and analysis to create a product with unique features and capabilities to already existing products. However, we also had to ensure Propsmarts had all the core capabilities that its competitors offered. This phase of the project served as the compass guiding the product's development. ": "Para criar um produto com vantagem competitiva, a diferenciação é fundamental. É por isso que tivemos que fazer uma pesquisa e análise de mercado completas para criar um produto com recursos e recursos exclusivos para produtos já existentes. No entanto, também tínhamos que garantir que a Propsmarts tivesse todos os recursos básicos que seus concorrentes ofereciam. Essa fase do projeto serviu de bússola para o desenvolvimento do produto.",
    "Conceptualization and Design": "Conceituação e Design",
    "Following the market analysis, our next step was to interpret the collected data and align it with the client's specifications. This allowed us to formulate a concept design for the project. Throughout this process, we maintained close collaboration with the client to ensure that the design matched their expectations. Additionally, we ensured the seamless integration of all the envisioned features and functionalities that Propsmarts was set to offer within this concept design. ": "Após a análise de mercado, nosso próximo passo foi interpretar os dados coletados e alinhá-los com as especificações do cliente. Isso nos permitiu formular um conceito de design para o projeto. Ao longo deste processo, mantivemos uma estreita colaboração com o cliente para garantir que o projeto correspondia às suas expectativas. Além disso, garantimos a integração perfeita de todos os recursos e funcionalidades previstos que o Propsmarts foi definido para oferecer neste projeto de conceito.",
    "Development and Engineering": "Desenvolvimento e Engenharia",
    "After the client approved the concept, it was time to get our hands dirty. The development process involved creating a robust backend infrastructure capable of handling data processing, analysis, and user interactions. We also had to create the user interface (front-end) of the platform and ensure it offers a seamless user experience, emphasizing usability and responsiveness. ": "Depois que o cliente aprovou o conceito, era hora de colocar a mão na massa. O processo de desenvolvimento envolveu a criação de uma infraestrutura de back-end robusta capaz de lidar com processamento de dados, análise e interações do usuário. Também tivemos que criar a interface do usuário (front-end) da plataforma e garantir que ela oferecesse uma experiência de usuário perfeita, enfatizando a usabilidade e a capacidade de resposta.",
    "Data Integration and Analysis": "Integração e análise de dados",
    "When it comes to any property investment platform, the accessibility and integrity of data is crucial. With Propsmarts, we had to integrate several data sources to provide users with comprehensive property information, allowing them to make informed decisions. This involved creating algorithms to perform tasks such as property valuation, market trend analysis, and investment projections. ": "Quando se trata de qualquer plataforma de investimento imobiliário, a acessibilidade e a integridade dos dados são cruciais. Com o Propsmarts, tivemos que integrar várias fontes de dados para fornecer aos usuários informações abrangentes sobre propriedades, permitindo que eles tomassem decisões informadas. Isso envolveu a criação de algoritmos para executar tarefas como avaliação de propriedades, análise de tendências de mercado e projeções de investimentos.",
    "Testing and fine-tuning the product": "Testando e ajustando o produto",
    "After building the product, it is crucial to ensure it works as intended; that’s why testing and fine-tuning were crucial. We did this through rigorous usability testing involving diverse potential users. We then used this feedback to fine-tune the user experience of the products by identifying and addressing performance bottlenecks and optimizing for speed and efficiency. ": "Depois de construir o produto, é crucial garantir que ele funcione como pretendido; é por isso que testes e ajustes finos foram cruciais. Fizemos isso por meio de rigorosos testes de usabilidade envolvendo diversos usuários em potencial. Em seguida, usamos esse feedback para ajustar a experiência do usuário dos produtos, identificando e abordando gargalos de desempenho e otimizando a velocidade e a eficiência.",
    "The creation of Propsmarts encompassed multiple processes, as detailed in this article. Throughout each stage, our team collaborated with the client to ensure we were on the right track regarding their requirements. Ultimately, the client loved the outcome, and our team also learned valuable lessons that we aim to incorporate into our future projects. We are grateful to Propsmarts for trusting us with this project. ": "A criação da Propsmarts envolveu múltiplos processos, conforme detalhado neste artigo. Ao longo de cada etapa, nossa equipe colaborou com o cliente para garantir que estávamos no caminho certo em relação às suas necessidades. Por fim, o cliente adorou o resultado e nossa equipe também aprendeu lições valiosas que pretendemos incorporar em nossos projetos futuros. Agradecemos à Propsmarts por nos confiar este projeto. ",
    "Request a call": "Solicite uma ligação",
    "Fill out the form below and receive our free consultation": "Preencha o formulário abaixo e receba nossa consultoria gratuita",
    "Sales": "Vendas",
    "Name": "Nome *",
    "Email address": "Endereço de email *",
    "Phone number": "Número de telefone *",
    "Company Name": "nome da empresa *",
    "Some field is missing.": "Algum campo está faltando.",
    "Submit Request": "Enviar pedido",
    "Your message has been sent!": "Sua mensagem foi enviada!",
    "Interest": "Interesse",
    "Thank you for sending us a message. One of our experts touch in the next 24-48 hours!": "Obrigado por nos enviar uma mensagem. Um de nossos especialistas toca nas próximas 24 a 48 horas!",
    
    "Email field is required.": "O campo email é obrigatório.",
    "Invalid email format.": "Formato de e-mail inválido.",
    "Name field is required.": "O campo nome é obrigatório.",
    "Interest field is required.": "O campo de interesse é obrigatório.",
    "Company Name field is required.": "O campo Nome da empresa é obrigatório.",
    "PhoneNumber field is required.": "O campo PhoneNumber é obrigatório.",
    "Invalid phone number format.": "Formato de número de telefone inválido.",

    "25 July 2023": "25 Julho 2023",
    "30 June 2023": "30 Junho 2023",
    "30 April 2023": "30 Abril 2023"

}